2024-05-21T19:04:10.1075690Z Current runner version: '2.316.1'
2024-05-21T19:04:10.1081524Z Runner name: 'bm-i-0864f0822a521acb1-worker-04'
2024-05-21T19:04:10.1082294Z Runner group name: 'Default'
2024-05-21T19:04:10.1083072Z Machine name: '7d3b6eff9612'
2024-05-21T19:04:10.1085297Z ##[group]GITHUB_TOKEN Permissions
2024-05-21T19:04:10.1086966Z Contents: read
2024-05-21T19:04:10.1087492Z Metadata: read
2024-05-21T19:04:10.1087871Z ##[endgroup]
2024-05-21T19:04:10.1090063Z Secret source: Actions
2024-05-21T19:04:10.1090742Z Prepare workflow directory
2024-05-21T19:04:10.2111126Z Prepare all required actions
2024-05-21T19:04:10.2285219Z Getting action download info
2024-05-21T19:04:10.3762864Z Download action repository 'actions/checkout@v4' (SHA:a5ac7e51b41094c92402da3b24376905380afc29)
2024-05-21T19:04:10.6795088Z Download action repository 'actions/download-artifact@v4' (SHA:65a9edc5881444af0b9093a5e628f2fe47ea3b2e)
2024-05-21T19:04:10.9555479Z Download action repository 'libbpf/ci@main' (SHA:5618ba5cc00e40916ecddccbd5f885b29b83b68e)
2024-05-21T19:04:11.2602338Z Uses: kernel-patches/bpf/.github/workflows/kernel-test.yml@refs/pull/7057/merge (b5d4ef6375935c4c56280df9770e915a0d698261)
2024-05-21T19:04:11.2604854Z ##[group] Inputs
2024-05-21T19:04:11.2605262Z   arch: x86_64
2024-05-21T19:04:11.2605629Z   toolchain_full: llvm-17
2024-05-21T19:04:11.2606066Z   runs_on: [
  "self-hosted",
  "x86_64"
]
2024-05-21T19:04:11.2606567Z   kernel: LATEST

2024-05-21T19:06:01.7939617Z #137/99  linked_list/direct_read_node:OK
2024-05-21T19:06:01.7940042Z #137/100 linked_list/direct_write_node:OK
2024-05-21T19:06:01.7940500Z #137/101 linked_list/use_after_unlock_push_front:OK
2024-05-21T19:06:01.7941019Z #137/102 linked_list/use_after_unlock_push_back:OK
2024-05-21T19:06:01.7941502Z #137/103 linked_list/double_push_front:OK
2024-05-21T19:06:01.7941917Z #137/104 linked_list/double_push_back:OK
2024-05-21T19:06:01.7942349Z #137/105 linked_list/no_node_value_type:OK
2024-05-21T19:06:01.7942804Z #137/106 linked_list/incorrect_value_type:OK
2024-05-21T19:06:01.7943258Z #137/107 linked_list/incorrect_node_var_off:OK
2024-05-21T19:06:01.7943717Z #137/108 linked_list/incorrect_node_off1:OK
2024-05-21T19:06:01.7944164Z #137/109 linked_list/incorrect_node_off2:OK
2024-05-21T19:06:01.7944586Z #137/110 linked_list/no_head_type:OK
2024-05-21T19:06:01.7945020Z #137/111 linked_list/incorrect_head_var_off1:OK
2024-05-21T19:06:01.7945503Z #137/112 linked_list/incorrect_head_var_off2:OK
2024-05-21T19:06:01.7945953Z #137/113 linked_list/incorrect_head_off1:OK
2024-05-21T19:06:01.7946397Z #137/114 linked_list/incorrect_head_off2:OK
2024-05-21T19:06:01.7946827Z #137/115 linked_list/pop_front_off:OK
2024-05-21T19:06:01.7947216Z #137/116 linked_list/pop_back_off:OK
2024-05-21T19:06:01.7947633Z #137/117 linked_list/btf: too many locks:OK
2024-05-21T19:06:01.7948071Z #137/118 linked_list/btf: missing lock:OK
2024-05-21T19:06:01.7948483Z #137/119 linked_list/btf: bad offset:OK
2024-05-21T19:06:01.7961166Z #137/120 linked_list/btf: missing contains::OK
2024-05-21T19:06:01.7961682Z #137/121 linked_list/btf: missing struct:OK
2024-05-21T19:06:01.7962133Z #137/122 linked_list/btf: missing node:OK
2024-05-21T19:06:01.7962608Z #137/123 linked_list/btf: node incorrect type:OK
2024-05-21T19:06:01.7963246Z #137/124 linked_list/btf: multiple bpf_list_node with name b:OK
2024-05-21T19:06:01.7963888Z #137/125 linked_list/btf: owning | owned AA cycle:OK
2024-05-21T19:06:01.7964663Z #137/126 linked_list/btf: owning | owned ABA cycle:OK
2024-05-21T19:06:01.7965486Z #137/127 linked_list/btf: owning -> owned:OK
2024-05-21T19:06:01.7966142Z #137/128 linked_list/btf: owning -> owning | owned -> owned:OK
2024-05-21T19:06:01.7966886Z #137/129 linked_list/btf: owning | owned -> owning | owned -> owned:OK
2024-05-21T19:06:01.7967768Z #137/130 linked_list/btf: owning -> owning | owned -> owning | owned -> owned:OK
2024-05-21T19:06:01.7968554Z #137/131 linked_list/btf: list_node and rb_node in same struct:OK
2024-05-21T19:06:01.7969316Z #137/132 linked_list/btf: list_node and rb_node in same struct, no bpf_refcount:OK
2024-05-21T19:06:01.7969967Z #137     linked_list:OK
2024-05-21T19:06:01.8136369Z #138     linked_maps:OK
2024-05-21T19:06:01.9165958Z #139     linked_vars:OK
2024-05-21T19:06:01.9784992Z #140/1   link_pinning/pin_raw_tp:OK
2024-05-21T19:06:01.9786059Z #140/2   link_pinning/pin_tp_btf:OK
2024-05-21T19:06:01.9786491Z #140     link_pinning:OK
2024-05-21T19:06:01.9920057Z #141     load_bytes_relative:OK
2024-05-21T19:06:02.1051468Z #142/1   local_kptr_stash/local_kptr_stash_simple:OK
2024-05-21T19:06:02.1052170Z #142/2   local_kptr_stash/local_kptr_stash_plain:OK
2024-05-21T19:06:02.1052768Z #142/3   local_kptr_stash/local_kptr_stash_local_with_root:OK
2024-05-21T19:06:02.1053403Z #142/4   local_kptr_stash/local_kptr_stash_unstash:OK
2024-05-21T19:06:02.1054030Z #142/5   local_kptr_stash/refcount_acquire_without_unstash:OK
2024-05-21T19:06:02.1054629Z #142/6   local_kptr_stash/local_kptr_stash_fail:OK
2024-05-21T19:06:02.1055131Z #142/7   local_kptr_stash/stash_rb_nodes:OK
2024-05-21T19:06:02.1055629Z #142/8   local_kptr_stash/drop_rb_node_off:OK
2024-05-21T19:06:02.1056095Z #142     local_kptr_stash:OK
2024-05-21T19:06:02.1057901Z #143/1   log_buf/obj_load_log_buf:OK
2024-05-21T19:06:02.1058365Z #143/2   log_buf/bpf_prog_load_log_buf:OK
2024-05-21T19:06:02.1058853Z #143/3   log_buf/bpf_btf_load_log_buf:OK
2024-05-21T19:06:02.1059253Z #143     log_buf:OK
2024-05-21T19:06:02.2452139Z #144/1   log_fixup/bad_core_relo_trunc_none:OK
2024-05-21T19:06:02.2452780Z #144/2   log_fixup/bad_core_relo_trunc_partial:OK
2024-05-21T19:06:02.2453298Z #144/3   log_fixup/bad_core_relo_trunc_full:OK
2024-05-21T19:06:02.2453798Z #144/4   log_fixup/bad_core_relo_subprog:OK
2024-05-21T19:06:02.2454262Z #144/5   log_fixup/missing_map:OK
2024-05-21T19:06:02.2454657Z #144/6   log_fixup/missing_kfunc:OK
2024-05-21T19:06:02.2455068Z #144     log_fixup:OK
2024-05-21T19:06:02.2953533Z #145/1   lookup_and_delete/lookup_and_delete:OK
2024-05-21T19:06:02.2954179Z #145/2   lookup_and_delete/lookup_and_delete_percpu:OK
2024-05-21T19:06:02.2954752Z #145/3   lookup_and_delete/lookup_and_delete_lru:OK
2024-05-21T19:06:02.2955352Z #145/4   lookup_and_delete/lookup_and_delete_lru_percpu:OK
2024-05-21T19:06:02.2955886Z #145     lookup_and_delete:OK
2024-05-21T19:06:02.4434638Z #146     lookup_key:OK
2024-05-21T19:06:02.6935560Z #147     lru_bug:OK
2024-05-21T19:06:03.0780526Z #148/1   lsm_cgroup/functional:OK
2024-05-21T19:06:03.0781054Z #148/2   lsm_cgroup/nonvoid:OK
2024-05-21T19:06:03.0781436Z #148     lsm_cgroup:OK
2024-05-21T19:06:03.1046409Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:06:03.1540330Z 
2024-05-21T19:06:03.1541393Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:03.1542180Z  - Length:       2231
2024-05-21T19:06:03.1542536Z Verifier analysis:
2024-05-21T19:06:03.1542736Z 
2024-05-21T19:06:03.1542872Z magic: 0xeb9f
2024-05-21T19:06:03.1543144Z version: 1
2024-05-21T19:06:03.1543425Z flags: 0x0
2024-05-21T19:06:03.1543698Z hdr_len: 24
2024-05-21T19:06:03.1543961Z type_off: 0
2024-05-21T19:06:03.1544237Z type_len: 900
2024-05-21T19:06:03.1544505Z str_off: 900
2024-05-21T19:06:03.1544788Z str_len: 1307
2024-05-21T19:06:03.1545089Z btf_total_size: 2231
2024-05-21T19:06:03.1545410Z [1] PTR (anon) type_id=2
2024-05-21T19:06:03.1545807Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:03.1546232Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:03.1546852Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:03.1547277Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:03.1547689Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:03.1548114Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:03.1548553Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:03.1548994Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:03.1549398Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:03.1549832Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:03.1550279Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:03.1550713Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:03.1551128Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:03.1551546Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:03.1551912Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:03.1552323Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:03.1552871Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:03.1553254Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:03.1553684Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:03.1554103Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:03.1554497Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:03.1554928Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:03.1555362Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:03.1555766Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:03.1556203Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:03.1556649Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:03.1557066Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:03.1557488Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:03.1557904Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:03.1558314Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:03.1558747Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:03.1559187Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:03.1559592Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:03.1560054Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:03.1560518Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:03.1560924Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:03.1561454Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:03.1562113Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:03.1562788Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:03.1563443Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:03.1563952Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:03.1564378Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:03.1564766Z [9] PTR (anon) type_id=29
2024-05-21T19:06:03.1565137Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:03.1565716Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:03.1566318Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:03.1566720Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:03.1567098Z [13] PTR (anon) type_id=30
2024-05-21T19:06:03.1567447Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:03.1567984Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:03.1568609Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1569155Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:03.1569724Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:03.1570203Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1570674Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:03.1571160Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1571692Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:03.1572183Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1572686Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:03.1573272Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:03.1573857Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:03.1574456Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:03.1574928Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:03.1575248Z 
2024-05-21T19:06:03.1634209Z 
2024-05-21T19:06:03.1634871Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:03.1635485Z  - Length:       2231
2024-05-21T19:06:03.1635855Z Verifier analysis:
2024-05-21T19:06:03.1636051Z 
2024-05-21T19:06:03.1636189Z magic: 0xeb9f
2024-05-21T19:06:03.1636466Z version: 1
2024-05-21T19:06:03.1636754Z flags: 0x0
2024-05-21T19:06:03.1637046Z hdr_len: 24
2024-05-21T19:06:03.1637309Z type_off: 0
2024-05-21T19:06:03.1637590Z type_len: 900
2024-05-21T19:06:03.1637892Z str_off: 900
2024-05-21T19:06:03.1638159Z str_len: 1307
2024-05-21T19:06:03.1638447Z btf_total_size: 2231
2024-05-21T19:06:03.1638774Z [1] PTR (anon) type_id=2
2024-05-21T19:06:03.1639308Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:03.1639724Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:03.1640139Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:03.1640536Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:03.1640948Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:03.1641395Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:03.1641808Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:03.1642248Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:03.1642675Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:03.1643083Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:03.1643525Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:03.1643985Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:03.1644375Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:03.1644805Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:03.1645186Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:03.1645617Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:03.1646025Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:03.1646434Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:03.1646858Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:03.1647253Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:03.1647667Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:03.1648094Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:03.1648503Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:03.1648931Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:03.1649364Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:03.1649791Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:03.1650230Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:03.1650658Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:03.1651051Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:03.1651475Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:03.1651907Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:03.1652310Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:03.1652733Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:03.1653170Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:03.1653606Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:03.1654025Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:03.1654546Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:03.1655182Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:03.1655846Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:03.1656514Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:03.1656986Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:03.1657380Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:03.1658024Z [9] PTR (anon) type_id=29
2024-05-21T19:06:03.1658368Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:03.1659003Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:03.1659630Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:03.1660004Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:03.1660385Z [13] PTR (anon) type_id=30
2024-05-21T19:06:03.1660882Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:03.1661404Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:03.1662031Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1662613Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:03.1663148Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:03.1663636Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1664127Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:03.1664599Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1665115Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:03.1665636Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:03.1666119Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:03.1666780Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:03.1667401Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:03.1667908Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:03.1668385Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:03.1668732Z 
2024-05-21T19:06:05.2504027Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:06:05.2991731Z 
2024-05-21T19:06:05.2992801Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:05.2993576Z  - Length:       2231
2024-05-21T19:06:05.2993919Z Verifier analysis:
2024-05-21T19:06:05.2994147Z 
2024-05-21T19:06:05.2994261Z magic: 0xeb9f
2024-05-21T19:06:05.2994568Z version: 1
2024-05-21T19:06:05.2994837Z flags: 0x0
2024-05-21T19:06:05.2995120Z hdr_len: 24
2024-05-21T19:06:05.2995421Z type_off: 0
2024-05-21T19:06:05.2995696Z type_len: 900
2024-05-21T19:06:05.2996025Z str_off: 900
2024-05-21T19:06:05.2996311Z str_len: 1307
2024-05-21T19:06:05.2996589Z btf_total_size: 2231
2024-05-21T19:06:05.2996963Z [1] PTR (anon) type_id=2
2024-05-21T19:06:05.2997341Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:05.2997767Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:05.2998161Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:05.2998585Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:05.2998976Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:05.2999432Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:05.2999885Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:05.3000307Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:05.3000743Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:05.3001192Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:05.3001623Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:05.3002090Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:05.3002510Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:05.3002900Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:05.3003288Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:05.3003706Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:05.3004110Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:05.3004558Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:05.3004978Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:05.3005370Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:05.3005791Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:05.3006225Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:05.3006643Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:05.3007072Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:05.3007514Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:05.3007943Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:05.3008385Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:05.3008813Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:05.3009196Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:05.3009593Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:05.3009996Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:05.3010406Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:05.3010789Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:05.3011535Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:05.3011972Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:05.3012354Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:05.3012853Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:05.3013479Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:05.3014108Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:05.3014753Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:05.3015220Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:05.3015577Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:05.3015955Z [9] PTR (anon) type_id=29
2024-05-21T19:06:05.3016293Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:05.3016843Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:05.3017811Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:05.3018182Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:05.3018531Z [13] PTR (anon) type_id=30
2024-05-21T19:06:05.3018877Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:05.3019395Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:05.3019989Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3020524Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:05.3021075Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:05.3021519Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3021998Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:05.3022479Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3022959Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:05.3023583Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3024333Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:05.3024894Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:05.3025506Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:05.3026022Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:05.3026467Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:05.3026812Z 
2024-05-21T19:06:05.3084172Z 
2024-05-21T19:06:05.3084889Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:05.3085517Z  - Length:       2231
2024-05-21T19:06:05.3085892Z Verifier analysis:
2024-05-21T19:06:05.3086094Z 
2024-05-21T19:06:05.3086202Z magic: 0xeb9f
2024-05-21T19:06:05.3086507Z version: 1
2024-05-21T19:06:05.3086793Z flags: 0x0
2024-05-21T19:06:05.3087055Z hdr_len: 24
2024-05-21T19:06:05.3087352Z type_off: 0
2024-05-21T19:06:05.3087679Z type_len: 900
2024-05-21T19:06:05.3087950Z str_off: 900
2024-05-21T19:06:05.3088250Z str_len: 1307
2024-05-21T19:06:05.3088555Z btf_total_size: 2231
2024-05-21T19:06:05.3088891Z [1] PTR (anon) type_id=2
2024-05-21T19:06:05.3089279Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:05.3089708Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:05.3090094Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:05.3090517Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:05.3090934Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:05.3091366Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:05.3091810Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:05.3092259Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:05.3092671Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:05.3093112Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:05.3093568Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:05.3094005Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:05.3094433Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:05.3094852Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:05.3095228Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:05.3095654Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:05.3096087Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:05.3096690Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:05.3097128Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:05.3097556Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:05.3098025Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:05.3098466Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:05.3098907Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:05.3099319Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:05.3099762Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:05.3100216Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:05.3100633Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:05.3101058Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:05.3101473Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:05.3101884Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:05.3102315Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:05.3102841Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:05.3103241Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:05.3103689Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:05.3104153Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:05.3104556Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:05.3105081Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:05.3105730Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:05.3106374Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:05.3107040Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:05.3107531Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:05.3107923Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:05.3108303Z [9] PTR (anon) type_id=29
2024-05-21T19:06:05.3108681Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:05.3109245Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:05.3109840Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:05.3110232Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:05.3110614Z [13] PTR (anon) type_id=30
2024-05-21T19:06:05.3110959Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:05.3111495Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:05.3112114Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3112652Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:05.3113204Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:05.3113681Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3114139Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:05.3114624Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3115120Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:05.3115606Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:05.3116103Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:05.3116679Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:05.3117267Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:05.3117867Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:05.3118328Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:05.3118650Z 
2024-05-21T19:06:07.3857050Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:06:07.4335016Z 
2024-05-21T19:06:07.4335798Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:07.4336404Z  - Length:       2231
2024-05-21T19:06:07.4336747Z Verifier analysis:
2024-05-21T19:06:07.4336939Z 
2024-05-21T19:06:07.4337053Z magic: 0xeb9f
2024-05-21T19:06:07.4337306Z version: 1
2024-05-21T19:06:07.4337563Z flags: 0x0
2024-05-21T19:06:07.4337924Z hdr_len: 24
2024-05-21T19:06:07.4338167Z type_off: 0
2024-05-21T19:06:07.4338435Z type_len: 900
2024-05-21T19:06:07.4338695Z str_off: 900
2024-05-21T19:06:07.4338957Z str_len: 1307
2024-05-21T19:06:07.4339245Z btf_total_size: 2231
2024-05-21T19:06:07.4339550Z [1] PTR (anon) type_id=2
2024-05-21T19:06:07.4339909Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:07.4340562Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:07.4340926Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:07.4341374Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:07.4341758Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:07.4342182Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:07.4342586Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:07.4343008Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:07.4343415Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:07.4343816Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:07.4344238Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:07.4344675Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:07.4345059Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:07.4345451Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:07.4345924Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:07.4346299Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:07.4346705Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:07.4347087Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:07.4347472Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:07.4347861Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:07.4348252Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:07.4348649Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:07.4349061Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:07.4349468Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:07.4349864Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:07.4350294Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:07.4350710Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:07.4351099Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:07.4351494Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:07.4351899Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:07.4352296Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:07.4352702Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:07.4353105Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:07.4353507Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:07.4353936Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:07.4354338Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:07.4354831Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:07.4355462Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:07.4356106Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:07.4356749Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:07.4357220Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:07.4357596Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:07.4357968Z [9] PTR (anon) type_id=29
2024-05-21T19:06:07.4358311Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:07.4358859Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:07.4359436Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:07.4359814Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:07.4360172Z [13] PTR (anon) type_id=30
2024-05-21T19:06:07.4360505Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:07.4361012Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:07.4361609Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4362134Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:07.4362665Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:07.4363116Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4363560Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:07.4364024Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4364505Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:07.4364990Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4365460Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:07.4366012Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:07.4366673Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:07.4367158Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:07.4367600Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:07.4367911Z 
2024-05-21T19:06:07.4428333Z 
2024-05-21T19:06:07.4429309Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:07.4430392Z  - Length:       2231
2024-05-21T19:06:07.4430943Z Verifier analysis:
2024-05-21T19:06:07.4431394Z 
2024-05-21T19:06:07.4431621Z magic: 0xeb9f
2024-05-21T19:06:07.4432102Z version: 1
2024-05-21T19:06:07.4432546Z flags: 0x0
2024-05-21T19:06:07.4433012Z hdr_len: 24
2024-05-21T19:06:07.4433478Z type_off: 0
2024-05-21T19:06:07.4433932Z type_len: 900
2024-05-21T19:06:07.4434396Z str_off: 900
2024-05-21T19:06:07.4434867Z str_len: 1307
2024-05-21T19:06:07.4435592Z btf_total_size: 2231
2024-05-21T19:06:07.4436170Z [1] PTR (anon) type_id=2
2024-05-21T19:06:07.4436807Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:07.4437538Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:07.4438205Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:07.4438933Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:07.4439625Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:07.4440413Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:07.4441186Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:07.4441953Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:07.4442707Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:07.4443471Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:07.4444211Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:07.4445015Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:07.4445740Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:07.4446443Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:07.4447119Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:07.4447832Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:07.4448580Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:07.4449307Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:07.4450045Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:07.4450753Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:07.4451484Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:07.4452247Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:07.4452992Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:07.4453749Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:07.4454494Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:07.4455266Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:07.4456095Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:07.4456848Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:07.4457558Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:07.4458385Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:07.4459147Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:07.4459880Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:07.4460627Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:07.4461400Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:07.4462186Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:07.4462930Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:07.4463855Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:07.4464984Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:07.4466161Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:07.4467380Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:07.4468263Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:07.4468935Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:07.4469644Z [9] PTR (anon) type_id=29
2024-05-21T19:06:07.4470268Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:07.4471275Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:07.4472402Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:07.4473258Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:07.4473889Z [13] PTR (anon) type_id=30
2024-05-21T19:06:07.4474505Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:07.4475447Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:07.4476543Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4477549Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:07.4478538Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:07.4479366Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4480225Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:07.4481080Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4481962Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:07.4482865Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:07.4483863Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:07.4484841Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:07.4485937Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:07.4486863Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:07.4487656Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:07.4488261Z 
2024-05-21T19:06:09.5557324Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:06:09.6096572Z 
2024-05-21T19:06:09.6097284Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:09.6098159Z  - Length:       2231
2024-05-21T19:06:09.6098464Z Verifier analysis:
2024-05-21T19:06:09.6098741Z 
2024-05-21T19:06:09.6098842Z magic: 0xeb9f
2024-05-21T19:06:09.6099106Z version: 1
2024-05-21T19:06:09.6099343Z flags: 0x0
2024-05-21T19:06:09.6099588Z hdr_len: 24
2024-05-21T19:06:09.6099846Z type_off: 0
2024-05-21T19:06:09.6100085Z type_len: 900
2024-05-21T19:06:09.6100347Z str_off: 900
2024-05-21T19:06:09.6100701Z str_len: 1307
2024-05-21T19:06:09.6100968Z btf_total_size: 2231
2024-05-21T19:06:09.6101283Z [1] PTR (anon) type_id=2
2024-05-21T19:06:09.6101644Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:09.6102026Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:09.6102385Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:09.6102767Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:09.6103132Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:09.6103552Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:09.6103962Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:09.6104362Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:09.6104765Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:09.6105172Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:09.6105575Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:09.6106002Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:09.6106391Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:09.6106773Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:09.6107128Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:09.6107506Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:09.6107897Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:09.6108271Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:09.6108662Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:09.6109032Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:09.6109417Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:09.6109818Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:09.6110207Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:09.6110607Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:09.6111013Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:09.6111419Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:09.6111829Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:09.6112226Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:09.6112602Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:09.6113006Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:09.6113401Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:09.6114067Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:09.6114468Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:09.6114880Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:09.6115294Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:09.6115691Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:09.6116188Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:09.6116800Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:09.6117440Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:09.6118074Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:09.6118537Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:09.6118889Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:09.6119262Z [9] PTR (anon) type_id=29
2024-05-21T19:06:09.6119724Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:09.6120249Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:09.6120863Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:09.6121225Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:09.6121555Z [13] PTR (anon) type_id=30
2024-05-21T19:06:09.6121888Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:09.6122396Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:09.6122974Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6123509Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:09.6124031Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:09.6124467Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6124921Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:09.6125372Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6125836Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:09.6126319Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6126792Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:09.6127328Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:09.6127908Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:09.6128394Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:09.6128815Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:09.6129132Z 
2024-05-21T19:06:09.6197636Z 
2024-05-21T19:06:09.6198218Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:09.6198814Z  - Length:       2231
2024-05-21T19:06:09.6199179Z Verifier analysis:
2024-05-21T19:06:09.6199363Z 
2024-05-21T19:06:09.6199459Z magic: 0xeb9f
2024-05-21T19:06:09.6199722Z version: 1
2024-05-21T19:06:09.6199979Z flags: 0x0
2024-05-21T19:06:09.6200213Z hdr_len: 24
2024-05-21T19:06:09.6200463Z type_off: 0
2024-05-21T19:06:09.6200715Z type_len: 900
2024-05-21T19:06:09.6200963Z str_off: 900
2024-05-21T19:06:09.6201229Z str_len: 1307
2024-05-21T19:06:09.6201496Z btf_total_size: 2231
2024-05-21T19:06:09.6201794Z [1] PTR (anon) type_id=2
2024-05-21T19:06:09.6202146Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:09.6202540Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:09.6202891Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:09.6203273Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:09.6203651Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:09.6204055Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:09.6204461Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:09.6204874Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:09.6205262Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:09.6205669Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:09.6206086Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:09.6206504Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:09.6206891Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:09.6207283Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:09.6207630Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:09.6208011Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:09.6208577Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:09.6208951Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:09.6209347Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:09.6209738Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:09.6210115Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:09.6210518Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:09.6210923Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:09.6211309Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:09.6211718Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:09.6212156Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:09.6212556Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:09.6212959Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:09.6213350Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:09.6213818Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:09.6214229Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:09.6214640Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:09.6215057Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:09.6215476Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:09.6215915Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:09.6216298Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:09.6216803Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:09.6217435Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:09.6218148Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:09.6218800Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:09.6219276Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:09.6219636Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:09.6220024Z [9] PTR (anon) type_id=29
2024-05-21T19:06:09.6220370Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:09.6220903Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:09.6221498Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:09.6221868Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:09.6222204Z [13] PTR (anon) type_id=30
2024-05-21T19:06:09.6222545Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:09.6223054Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:09.6223635Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6224168Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:09.6224702Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:09.6225139Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6225597Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:09.6226057Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6226528Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:09.6227023Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:09.6227499Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:09.6228054Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:09.6228622Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:09.6229117Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:09.6229552Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:09.6229859Z 
2024-05-21T19:06:11.6994720Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:06:11.7479523Z 
2024-05-21T19:06:11.7480369Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:11.7480989Z  - Length:       2231
2024-05-21T19:06:11.7481337Z Verifier analysis:
2024-05-21T19:06:11.7481520Z 
2024-05-21T19:06:11.7481627Z magic: 0xeb9f
2024-05-21T19:06:11.7481891Z version: 1
2024-05-21T19:06:11.7482141Z flags: 0x0
2024-05-21T19:06:11.7482376Z hdr_len: 24
2024-05-21T19:06:11.7482630Z type_off: 0
2024-05-21T19:06:11.7482911Z type_len: 900
2024-05-21T19:06:11.7483163Z str_off: 900
2024-05-21T19:06:11.7483424Z str_len: 1307
2024-05-21T19:06:11.7483692Z btf_total_size: 2231
2024-05-21T19:06:11.7484278Z [1] PTR (anon) type_id=2
2024-05-21T19:06:11.7484646Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:11.7485042Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:11.7485405Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:11.7485792Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:11.7486183Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:11.7486616Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:11.7487050Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:11.7487546Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:11.7487952Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:11.7488383Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:11.7488829Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:11.7489264Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:11.7489684Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:11.7490233Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:11.7490596Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:11.7491011Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:11.7491436Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:11.7491817Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:11.7492240Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:11.7492658Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:11.7493057Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:11.7493488Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:11.7493914Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:11.7494320Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:11.7494755Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:11.7495203Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:11.7495626Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:11.7496048Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:11.7496475Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:11.7496875Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:11.7497308Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:11.7497824Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:11.7498228Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:11.7498670Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:11.7499123Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:11.7499527Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:11.7500062Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:11.7500717Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:11.7501360Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:11.7502028Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:11.7502520Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:11.7502920Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:11.7503311Z [9] PTR (anon) type_id=29
2024-05-21T19:06:11.7503673Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:11.7504248Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:11.7504839Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:11.7505226Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:11.7505604Z [13] PTR (anon) type_id=30
2024-05-21T19:06:11.7505946Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:11.7506482Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:11.7507103Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7507646Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:11.7508212Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:11.7508696Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7509157Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:11.7509652Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7510175Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:11.7510669Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7511297Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:11.7511883Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:11.7512469Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:11.7512994Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:11.7513463Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:11.7513780Z 
2024-05-21T19:06:11.7571694Z 
2024-05-21T19:06:11.7572312Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:06:11.7573293Z  - Length:       2231
2024-05-21T19:06:11.7573988Z Verifier analysis:
2024-05-21T19:06:11.7574257Z 
2024-05-21T19:06:11.7574439Z magic: 0xeb9f
2024-05-21T19:06:11.7574831Z version: 1
2024-05-21T19:06:11.7575233Z flags: 0x0
2024-05-21T19:06:11.7575669Z hdr_len: 24
2024-05-21T19:06:11.7576017Z type_off: 0
2024-05-21T19:06:11.7576293Z type_len: 900
2024-05-21T19:06:11.7576780Z str_off: 900
2024-05-21T19:06:11.7577044Z str_len: 1307
2024-05-21T19:06:11.7577342Z btf_total_size: 2231
2024-05-21T19:06:11.7577781Z [1] PTR (anon) type_id=2
2024-05-21T19:06:11.7578138Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:06:11.7578563Z 	len type_id=3 bits_offset=0
2024-05-21T19:06:11.7578954Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:06:11.7579343Z 	mark type_id=3 bits_offset=64
2024-05-21T19:06:11.7579751Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:06:11.7580203Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:06:11.7580616Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:06:11.7581050Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:06:11.7581480Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:06:11.7581894Z 	priority type_id=3 bits_offset=256
2024-05-21T19:06:11.7582337Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:06:11.7582790Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:06:11.7583184Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:06:11.7583600Z 	cb type_id=5 bits_offset=384
2024-05-21T19:06:11.7583978Z 	hash type_id=3 bits_offset=544
2024-05-21T19:06:11.7584369Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:06:11.7584788Z 	data type_id=3 bits_offset=608
2024-05-21T19:06:11.7585234Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:06:11.7585633Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:06:11.7586042Z 	family type_id=3 bits_offset=704
2024-05-21T19:06:11.7586455Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:06:11.7586862Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:06:11.7587297Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:06:11.7587727Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:06:11.7588136Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:06:11.7588583Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:06:11.7589021Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:06:11.7589428Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:06:11.7589848Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:06:11.7590271Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:06:11.7590679Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:06:11.7591112Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:06:11.7591537Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:06:11.7591955Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:06:11.7592415Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:06:11.7592829Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:06:11.7593329Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:11.7593981Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:06:11.7594648Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:06:11.7595290Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:06:11.7595787Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:06:11.7596181Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:06:11.7596564Z [9] PTR (anon) type_id=29
2024-05-21T19:06:11.7596929Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:06:11.7597597Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:06:11.7598221Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:06:11.7598595Z 	sk type_id=13 bits_offset=0
2024-05-21T19:06:11.7598973Z [13] PTR (anon) type_id=30
2024-05-21T19:06:11.7599316Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:06:11.7599852Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:06:11.7600470Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7601030Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:06:11.7601557Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:06:11.7602028Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7602516Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:06:11.7602971Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7603476Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:06:11.7604064Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:06:11.7604544Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:06:11.7605112Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:06:11.7605694Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:06:11.7606172Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:06:11.7606612Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:06:11.7606919Z 
2024-05-21T19:06:13.8373273Z #149/1   lwt_redirect/lwt_redirect_normal:OK
2024-05-21T19:06:13.8373928Z #149/2   lwt_redirect/lwt_redirect_normal_nomac:OK
2024-05-21T19:06:13.8374488Z #149/3   lwt_redirect/lwt_redirect_dev_down:OK
2024-05-21T19:06:13.8375005Z #149/4   lwt_redirect/lwt_redirect_dev_down_nomac:OK
2024-05-21T19:06:13.8375578Z #149/5   lwt_redirect/lwt_redirect_dev_carrier_down:OK
2024-05-21T19:06:13.8376074Z #149     lwt_redirect:OK
2024-05-21T19:06:14.0095902Z #151/1   map_btf/array_btf:OK
2024-05-21T19:06:14.0096770Z #151/2   map_btf/inner_array_btf:OK
2024-05-21T19:06:14.0097482Z #151     map_btf:OK
2024-05-21T19:06:14.0593515Z #152/1   map_init/pcpu_map_init:OK
2024-05-21T19:06:14.0594298Z #152/2   map_init/pcpu_lru_map_init:OK
2024-05-21T19:06:14.0594999Z #152     map_init:OK
2024-05-21T19:06:14.4614483Z #153/1   map_in_map/acc_map_in_array:OK
2024-05-21T19:06:14.4615110Z #153/2   map_in_map/sleepable_acc_map_in_array:OK
2024-05-21T19:06:14.4615686Z #153/3   map_in_map/acc_map_in_htab:OK
2024-05-21T19:06:14.4616194Z #153/4   map_in_map/sleepable_acc_map_in_htab:OK
2024-05-21T19:06:14.4616669Z #153     map_in_map:OK
2024-05-21T19:06:15.7915339Z #154/1   map_kptr/size_not_bpf_dw:OK
2024-05-21T19:06:15.7916267Z #154/2   map_kptr/non_const_var_off:OK
2024-05-21T19:06:15.7917133Z #154/3   map_kptr/non_const_var_off_kptr_xchg:OK
2024-05-21T19:06:15.7918099Z #154/4   map_kptr/misaligned_access_write:OK
2024-05-21T19:06:15.7918999Z #154/5   map_kptr/misaligned_access_read:OK
2024-05-21T19:06:15.7919888Z #154/6   map_kptr/reject_var_off_store:OK
2024-05-21T19:06:15.7920715Z #154/7   map_kptr/reject_bad_type_match:OK
2024-05-21T19:06:15.7921638Z #154/8   map_kptr/marked_as_untrusted_or_null:OK
2024-05-21T19:06:15.7922565Z #154/9   map_kptr/correct_btf_id_check_size:OK
2024-05-21T19:06:15.7923478Z #154/10  map_kptr/inherit_untrusted_on_walk:OK
2024-05-21T19:06:15.7924340Z #154/11  map_kptr/reject_kptr_xchg_on_unref:OK
2024-05-21T19:06:15.7925285Z #154/12  map_kptr/mark_ref_as_untrusted_or_null:OK
2024-05-21T19:06:15.7926275Z #154/13  map_kptr/reject_untrusted_store_to_ref:OK
2024-05-21T19:06:15.7927198Z #154/14  map_kptr/reject_untrusted_xchg:OK
2024-05-21T19:06:15.7928049Z #154/15  map_kptr/reject_bad_type_xchg:OK
2024-05-21T19:06:15.7928920Z #154/16  map_kptr/reject_member_of_ref_xchg:OK
2024-05-21T19:06:15.7929892Z #154/17  map_kptr/reject_indirect_global_func_access:OK
2024-05-21T19:06:15.7930857Z #154/18  map_kptr/kptr_xchg_ref_state:OK
2024-05-21T19:06:15.7931714Z #154/19  map_kptr/kptr_xchg_possibly_null:OK
2024-05-21T19:06:15.7932652Z #154/20  map_kptr/reject_indirect_helper_access:OK
2024-05-21T19:06:15.7933862Z #154/21  map_kptr/success-map:OK
2024-05-21T19:06:15.7935015Z #154     map_kptr:OK
2024-05-21T19:06:15.8110665Z #155     map_lock:OK
2024-05-21T19:06:15.8222110Z #156     map_lookup_percpu_elem:OK
2024-05-21T19:06:16.0742254Z #157/1   map_ops/map_ops_update_delete:OK
2024-05-21T19:06:16.0742765Z #157/2   map_ops/map_ops_push_peek_pop:OK
2024-05-21T19:06:16.0743195Z #157/3   map_ops/map_ops_for_each:OK
2024-05-21T19:06:16.0743618Z #157     map_ops:OK
2024-05-21T19:06:16.1231824Z #158     map_ptr:OK
2024-05-21T19:06:16.1234230Z #159/1   metadata/unused:OK
2024-05-21T19:06:16.1234599Z #159/2   metadata/used:OK
2024-05-21T19:06:16.1234917Z #159     metadata:OK
2024-05-21T19:06:19.9795148Z #160/1   migrate_reuseport/IPv4 TCP_ESTABLISHED  inet_csk_listen_stop:OK
2024-05-21T19:06:19.9795935Z #160/2   migrate_reuseport/IPv4 TCP_SYN_RECV     inet_csk_listen_stop:OK
2024-05-21T19:06:19.9797024Z #160/4   migrate_reuseport/IPv4 TCP_NEW_SYN_RECV inet_csk_complete_hashdance:OK
