2024-05-16T17:18:37.5397553Z Current runner version: '2.316.1'
2024-05-16T17:18:37.5402836Z Runner name: 'bm-i-06ae916dc1d358725-worker-01'
2024-05-16T17:18:37.5403508Z Runner group name: 'Default'
2024-05-16T17:18:37.5404212Z Machine name: 'd77bdd59cc66'
2024-05-16T17:18:37.5406389Z ##[group]GITHUB_TOKEN Permissions
2024-05-16T17:18:37.5408018Z Contents: read
2024-05-16T17:18:37.5408454Z Metadata: read
2024-05-16T17:18:37.5408854Z ##[endgroup]
2024-05-16T17:18:37.5411404Z Secret source: Actions
2024-05-16T17:18:37.5412035Z Prepare workflow directory
2024-05-16T17:18:37.6387608Z Prepare all required actions
2024-05-16T17:18:37.6550258Z Getting action download info
2024-05-16T17:18:37.8911353Z Download action repository 'actions/checkout@v4' (SHA:0ad4b8fadaa221de15dcec353f45205ec38ea70b)
2024-05-16T17:18:38.4132039Z Download action repository 'actions/download-artifact@v4' (SHA:65a9edc5881444af0b9093a5e628f2fe47ea3b2e)
2024-05-16T17:18:38.9291106Z Download action repository 'libbpf/ci@main' (SHA:5618ba5cc00e40916ecddccbd5f885b29b83b68e)
2024-05-16T17:18:39.4162902Z Uses: kernel-patches/bpf/.github/workflows/kernel-test.yml@refs/pull/7049/merge (83d41ed03a8ec249e9b505b3e00f9ebd739a5d72)
2024-05-16T17:18:39.4165092Z ##[group] Inputs
2024-05-16T17:18:39.4165418Z   arch: x86_64
2024-05-16T17:18:39.4165699Z   toolchain_full: gcc
2024-05-16T17:18:39.4166018Z   runs_on: [
  "self-hosted",
  "x86_64"
]
2024-05-16T17:18:39.4166403Z   kernel: LATEST

2024-05-16T17:20:50.7286600Z #137/99  linked_list/direct_read_node:OK
2024-05-16T17:20:50.7287023Z #137/100 linked_list/direct_write_node:OK
2024-05-16T17:20:50.7287571Z #137/101 linked_list/use_after_unlock_push_front:OK
2024-05-16T17:20:50.7288086Z #137/102 linked_list/use_after_unlock_push_back:OK
2024-05-16T17:20:50.7288567Z #137/103 linked_list/double_push_front:OK
2024-05-16T17:20:50.7288997Z #137/104 linked_list/double_push_back:OK
2024-05-16T17:20:50.7289414Z #137/105 linked_list/no_node_value_type:OK
2024-05-16T17:20:50.7289867Z #137/106 linked_list/incorrect_value_type:OK
2024-05-16T17:20:50.7290335Z #137/107 linked_list/incorrect_node_var_off:OK
2024-05-16T17:20:50.7290844Z #137/108 linked_list/incorrect_node_off1:OK
2024-05-16T17:20:50.7291294Z #137/109 linked_list/incorrect_node_off2:OK
2024-05-16T17:20:50.7291725Z #137/110 linked_list/no_head_type:OK
2024-05-16T17:20:50.7292148Z #137/111 linked_list/incorrect_head_var_off1:OK
2024-05-16T17:20:50.7292631Z #137/112 linked_list/incorrect_head_var_off2:OK
2024-05-16T17:20:50.7293096Z #137/113 linked_list/incorrect_head_off1:OK
2024-05-16T17:20:50.7293537Z #137/114 linked_list/incorrect_head_off2:OK
2024-05-16T17:20:50.7293968Z #137/115 linked_list/pop_front_off:OK
2024-05-16T17:20:50.7294452Z #137/116 linked_list/pop_back_off:OK
2024-05-16T17:20:50.7294878Z #137/117 linked_list/btf: too many locks:OK
2024-05-16T17:20:50.7295316Z #137/118 linked_list/btf: missing lock:OK
2024-05-16T17:20:50.7295741Z #137/119 linked_list/btf: bad offset:OK
2024-05-16T17:20:50.7309571Z #137/120 linked_list/btf: missing contains::OK
2024-05-16T17:20:50.7310070Z #137/121 linked_list/btf: missing struct:OK
2024-05-16T17:20:50.7310526Z #137/122 linked_list/btf: missing node:OK
2024-05-16T17:20:50.7311000Z #137/123 linked_list/btf: node incorrect type:OK
2024-05-16T17:20:50.7311572Z #137/124 linked_list/btf: multiple bpf_list_node with name b:OK
2024-05-16T17:20:50.7312181Z #137/125 linked_list/btf: owning | owned AA cycle:OK
2024-05-16T17:20:50.7312725Z #137/126 linked_list/btf: owning | owned ABA cycle:OK
2024-05-16T17:20:50.7313439Z #137/127 linked_list/btf: owning -> owned:OK
2024-05-16T17:20:50.7314079Z #137/128 linked_list/btf: owning -> owning | owned -> owned:OK
2024-05-16T17:20:50.7315179Z #137/129 linked_list/btf: owning | owned -> owning | owned -> owned:OK
2024-05-16T17:20:50.7316465Z #137/130 linked_list/btf: owning -> owning | owned -> owning | owned -> owned:OK
2024-05-16T17:20:50.7317227Z #137/131 linked_list/btf: list_node and rb_node in same struct:OK
2024-05-16T17:20:50.7317995Z #137/132 linked_list/btf: list_node and rb_node in same struct, no bpf_refcount:OK
2024-05-16T17:20:50.7318610Z #137     linked_list:OK
2024-05-16T17:20:50.7570611Z #138     linked_maps:OK
2024-05-16T17:20:50.8640395Z #139     linked_vars:OK
2024-05-16T17:20:50.9080988Z #140/1   link_pinning/pin_raw_tp:OK
2024-05-16T17:20:50.9081477Z #140/2   link_pinning/pin_tp_btf:OK
2024-05-16T17:20:50.9081862Z #140     link_pinning:OK
2024-05-16T17:20:50.9217072Z #141     load_bytes_relative:OK
2024-05-16T17:20:51.0413227Z #142/1   local_kptr_stash/local_kptr_stash_simple:OK
2024-05-16T17:20:51.0414238Z #142/2   local_kptr_stash/local_kptr_stash_plain:OK
2024-05-16T17:20:51.0415221Z #142/3   local_kptr_stash/local_kptr_stash_local_with_root:OK
2024-05-16T17:20:51.0416586Z #142/4   local_kptr_stash/local_kptr_stash_unstash:OK
2024-05-16T17:20:51.0417624Z #142/5   local_kptr_stash/refcount_acquire_without_unstash:OK
2024-05-16T17:20:51.0418583Z #142/6   local_kptr_stash/local_kptr_stash_fail:OK
2024-05-16T17:20:51.0419432Z #142/7   local_kptr_stash/stash_rb_nodes:OK
2024-05-16T17:20:51.0420258Z #142/8   local_kptr_stash/drop_rb_node_off:OK
2024-05-16T17:20:51.0420961Z #142     local_kptr_stash:OK
2024-05-16T17:20:51.0421562Z #143/1   log_buf/obj_load_log_buf:OK
2024-05-16T17:20:51.0422282Z #143/2   log_buf/bpf_prog_load_log_buf:OK
2024-05-16T17:20:51.0423028Z #143/3   log_buf/bpf_btf_load_log_buf:OK
2024-05-16T17:20:51.0423694Z #143     log_buf:OK
2024-05-16T17:20:51.1876601Z #144/1   log_fixup/bad_core_relo_trunc_none:OK
2024-05-16T17:20:51.1877507Z #144/2   log_fixup/bad_core_relo_trunc_partial:OK
2024-05-16T17:20:51.1878677Z #144/3   log_fixup/bad_core_relo_trunc_full:OK
2024-05-16T17:20:51.1879416Z #144/4   log_fixup/bad_core_relo_subprog:OK
2024-05-16T17:20:51.1880153Z #144/5   log_fixup/missing_map:OK
2024-05-16T17:20:51.1880792Z #144/6   log_fixup/missing_kfunc:OK
2024-05-16T17:20:51.1881435Z #144     log_fixup:OK
2024-05-16T17:20:51.2379868Z #145/1   lookup_and_delete/lookup_and_delete:OK
2024-05-16T17:20:51.2380759Z #145/2   lookup_and_delete/lookup_and_delete_percpu:OK
2024-05-16T17:20:51.2381648Z #145/3   lookup_and_delete/lookup_and_delete_lru:OK
2024-05-16T17:20:51.2382566Z #145/4   lookup_and_delete/lookup_and_delete_lru_percpu:OK
2024-05-16T17:20:51.2383377Z #145     lookup_and_delete:OK
2024-05-16T17:20:51.3780058Z #146     lookup_key:OK
2024-05-16T17:20:51.8581395Z #147     lru_bug:OK
2024-05-16T17:20:52.7159114Z #148/1   lsm_cgroup/functional:OK
2024-05-16T17:20:52.7160091Z #148/2   lsm_cgroup/nonvoid:OK
2024-05-16T17:20:52.7160525Z #148     lsm_cgroup:OK
2024-05-16T17:20:52.7423265Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-16T17:20:52.7913550Z 
2024-05-16T17:20:52.7914480Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:52.7915172Z  - Length:       2231
2024-05-16T17:20:52.7915487Z Verifier analysis:
2024-05-16T17:20:52.7915673Z 
2024-05-16T17:20:52.7915771Z magic: 0xeb9f
2024-05-16T17:20:52.7916036Z version: 1
2024-05-16T17:20:52.7916282Z flags: 0x0
2024-05-16T17:20:52.7916517Z hdr_len: 24
2024-05-16T17:20:52.7916775Z type_off: 0
2024-05-16T17:20:52.7917027Z type_len: 900
2024-05-16T17:20:52.7917276Z str_off: 900
2024-05-16T17:20:52.7917534Z str_len: 1307
2024-05-16T17:20:52.7917801Z btf_total_size: 2231
2024-05-16T17:20:52.7918103Z [1] PTR (anon) type_id=2
2024-05-16T17:20:52.7918454Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:52.7918850Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:52.7919202Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:52.7919590Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:52.7919970Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:52.7920391Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:52.7920800Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:52.7921230Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:52.7921643Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:52.7922048Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:52.7922469Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:52.7922890Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:52.7923279Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:52.7923673Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:52.7924023Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:52.7924410Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:52.7924812Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:52.7925180Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:52.7925579Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:52.7925969Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:52.7926351Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:52.7926768Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:52.7927177Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:52.7927858Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:52.7928287Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:52.7928716Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:52.7929121Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:52.7929525Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:52.7929916Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:52.7930303Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:52.7930793Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:52.7931196Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:52.7931578Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:52.7931991Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:52.7932418Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:52.7932801Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:52.7933420Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:52.7934057Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:52.7934702Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:52.7935357Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:52.7935834Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:52.7936205Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:52.7936572Z [9] PTR (anon) type_id=29
2024-05-16T17:20:52.7936908Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:52.7937450Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:52.7938029Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:52.7938395Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:52.7938745Z [13] PTR (anon) type_id=30
2024-05-16T17:20:52.7939073Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:52.7939578Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:52.7940185Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.7940709Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:52.7941245Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:52.7941698Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.7942146Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:52.7942603Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.7943083Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:52.7943556Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.7944035Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:52.7944586Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:52.7945157Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:52.7945656Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:52.7946092Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:52.7946408Z 
2024-05-16T17:20:52.8008491Z 
2024-05-16T17:20:52.8009536Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:52.8010505Z  - Length:       2231
2024-05-16T17:20:52.8010889Z Verifier analysis:
2024-05-16T17:20:52.8011089Z 
2024-05-16T17:20:52.8011216Z magic: 0xeb9f
2024-05-16T17:20:52.8011475Z version: 1
2024-05-16T17:20:52.8011720Z flags: 0x0
2024-05-16T17:20:52.8011954Z hdr_len: 24
2024-05-16T17:20:52.8012206Z type_off: 0
2024-05-16T17:20:52.8012444Z type_len: 900
2024-05-16T17:20:52.8012709Z str_off: 900
2024-05-16T17:20:52.8012965Z str_len: 1307
2024-05-16T17:20:52.8013220Z btf_total_size: 2231
2024-05-16T17:20:52.8013527Z [1] PTR (anon) type_id=2
2024-05-16T17:20:52.8013879Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:52.8014269Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:52.8014636Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:52.8015023Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:52.8015394Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:52.8015823Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:52.8016230Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:52.8016824Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:52.8017235Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:52.8017643Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:52.8018049Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:52.8018482Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:52.8018872Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:52.8019246Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:52.8019606Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:52.8019988Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:52.8020377Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:52.8020749Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:52.8021141Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:52.8021517Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:52.8021906Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:52.8022394Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:52.8022789Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:52.8023195Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:52.8023606Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:52.8024017Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:52.8024433Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:52.8024833Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:52.8025214Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:52.8025614Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:52.8026014Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:52.8026402Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:52.8026798Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:52.8027210Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:52.8027627Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:52.8028024Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:52.8028528Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:52.8029146Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:52.8029800Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:52.8030452Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:52.8030922Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:52.8031279Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:52.8031656Z [9] PTR (anon) type_id=29
2024-05-16T17:20:52.8031993Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:52.8032522Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:52.8033117Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:52.8033484Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:52.8033824Z [13] PTR (anon) type_id=30
2024-05-16T17:20:52.8034162Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:52.8034669Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:52.8035260Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.8035807Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:52.8036344Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:52.8036784Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.8037243Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:52.8037697Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.8038165Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:52.8038649Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:52.8039128Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:52.8039670Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:52.8040256Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:52.8040752Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:52.8041176Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:52.8041509Z 
2024-05-16T17:20:54.8956331Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-16T17:20:54.9437871Z 
2024-05-16T17:20:54.9439275Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:54.9440201Z  - Length:       2231
2024-05-16T17:20:54.9440517Z Verifier analysis:
2024-05-16T17:20:54.9440709Z 
2024-05-16T17:20:54.9440820Z magic: 0xeb9f
2024-05-16T17:20:54.9441072Z version: 1
2024-05-16T17:20:54.9441321Z flags: 0x0
2024-05-16T17:20:54.9441569Z hdr_len: 24
2024-05-16T17:20:54.9441812Z type_off: 0
2024-05-16T17:20:54.9442065Z type_len: 900
2024-05-16T17:20:54.9442331Z str_off: 900
2024-05-16T17:20:54.9442576Z str_len: 1307
2024-05-16T17:20:54.9442845Z btf_total_size: 2231
2024-05-16T17:20:54.9443160Z [1] PTR (anon) type_id=2
2024-05-16T17:20:54.9443495Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:54.9443895Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:54.9444264Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:54.9444643Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:54.9445209Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:54.9445636Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:54.9446045Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:54.9446466Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:54.9446876Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:54.9447278Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:54.9447698Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:54.9448133Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:54.9448516Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:54.9448905Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:54.9449265Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:54.9449637Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:54.9450038Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:54.9450415Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:54.9450880Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:54.9451272Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:54.9451671Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:54.9452065Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:54.9452479Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:54.9452884Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:54.9453280Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:54.9453704Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:54.9454116Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:54.9454502Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:54.9454892Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:54.9455291Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:54.9455683Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:54.9456083Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:54.9456477Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:54.9456879Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:54.9457308Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:54.9457710Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:54.9458200Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:54.9458846Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:54.9459512Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:54.9460149Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:54.9460623Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:54.9460998Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:54.9461372Z [9] PTR (anon) type_id=29
2024-05-16T17:20:54.9461735Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:54.9462303Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:54.9462907Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:54.9463295Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:54.9463660Z [13] PTR (anon) type_id=30
2024-05-16T17:20:54.9463991Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:54.9464502Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:54.9465110Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9465744Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:54.9466284Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:54.9466747Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9467199Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:54.9467666Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9468159Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:54.9468637Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9469144Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:54.9469735Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:54.9470358Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:54.9470866Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:54.9471347Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:54.9471753Z 
2024-05-16T17:20:54.9530811Z 
2024-05-16T17:20:54.9531504Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:54.9532678Z  - Length:       2231
2024-05-16T17:20:54.9532996Z Verifier analysis:
2024-05-16T17:20:54.9533216Z 
2024-05-16T17:20:54.9533328Z magic: 0xeb9f
2024-05-16T17:20:54.9533626Z version: 1
2024-05-16T17:20:54.9533879Z flags: 0x0
2024-05-16T17:20:54.9534155Z hdr_len: 24
2024-05-16T17:20:54.9534440Z type_off: 0
2024-05-16T17:20:54.9534706Z type_len: 900
2024-05-16T17:20:54.9535000Z str_off: 900
2024-05-16T17:20:54.9535293Z str_len: 1307
2024-05-16T17:20:54.9535573Z btf_total_size: 2231
2024-05-16T17:20:54.9535919Z [1] PTR (anon) type_id=2
2024-05-16T17:20:54.9536307Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:54.9536716Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:54.9537083Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:54.9537475Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:54.9537853Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:54.9538280Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:54.9538698Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:54.9539106Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:54.9539511Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:54.9539921Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:54.9540332Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:54.9540769Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:54.9541158Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:54.9541542Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:54.9541905Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:54.9542295Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:54.9542681Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:54.9543060Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:54.9543460Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:54.9543842Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:54.9544242Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:54.9544653Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:54.9545058Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:54.9545469Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:54.9545883Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:54.9546296Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:54.9546714Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:54.9547119Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:54.9547500Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:54.9547906Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:54.9548306Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:54.9548693Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:54.9549089Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:54.9549501Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:54.9549916Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:54.9550318Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:54.9550822Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:54.9551613Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:54.9552275Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:54.9552931Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:54.9553395Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:54.9553765Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:54.9554149Z [9] PTR (anon) type_id=29
2024-05-16T17:20:54.9554471Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:54.9555013Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:54.9555607Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:54.9555964Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:54.9556310Z [13] PTR (anon) type_id=30
2024-05-16T17:20:54.9556651Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:54.9557148Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:54.9557820Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9558369Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:54.9558891Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:54.9559345Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9559803Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:54.9560248Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9560730Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:54.9561214Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:54.9561679Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:54.9562241Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:54.9562828Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:54.9563325Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:54.9563753Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:54.9564082Z 
2024-05-16T17:20:57.0527395Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-16T17:20:57.1003446Z 
2024-05-16T17:20:57.1004045Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:57.1004669Z  - Length:       2231
2024-05-16T17:20:57.1004971Z Verifier analysis:
2024-05-16T17:20:57.1005218Z 
2024-05-16T17:20:57.1005316Z magic: 0xeb9f
2024-05-16T17:20:57.1005584Z version: 1
2024-05-16T17:20:57.1005821Z flags: 0x0
2024-05-16T17:20:57.1006065Z hdr_len: 24
2024-05-16T17:20:57.1006320Z type_off: 0
2024-05-16T17:20:57.1006561Z type_len: 900
2024-05-16T17:20:57.1006823Z str_off: 900
2024-05-16T17:20:57.1007081Z str_len: 1307
2024-05-16T17:20:57.1007333Z btf_total_size: 2231
2024-05-16T17:20:57.1007646Z [1] PTR (anon) type_id=2
2024-05-16T17:20:57.1007997Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:57.1008384Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:57.1008770Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:57.1009186Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:57.1009556Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:57.1009977Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:57.1010396Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:57.1010966Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:57.1011393Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:57.1011808Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:57.1012219Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:57.1012661Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:57.1013056Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:57.1013435Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:57.1013797Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:57.1014220Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:57.1014610Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:57.1014992Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:57.1015388Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:57.1015773Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:57.1016168Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:57.1016853Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:57.1017256Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:57.1017745Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:57.1018173Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:57.1018609Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:57.1019028Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:57.1019433Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:57.1019815Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:57.1020281Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:57.1020689Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:57.1021077Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:57.1021473Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:57.1021890Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:57.1022394Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:57.1022924Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:57.1023440Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:57.1024084Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:57.1033969Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:57.1034763Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:57.1035243Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:57.1035618Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:57.1035990Z [9] PTR (anon) type_id=29
2024-05-16T17:20:57.1036328Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:57.1036870Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:57.1037480Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:57.1037926Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:57.1038278Z [13] PTR (anon) type_id=30
2024-05-16T17:20:57.1038603Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:57.1039125Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:57.1039735Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1040265Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:57.1040796Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:57.1041252Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1041766Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:57.1042224Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1042704Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:57.1043177Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1043756Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:57.1044310Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:57.1044883Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:57.1045377Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:57.1045823Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:57.1046136Z 
2024-05-16T17:20:57.1096100Z 
2024-05-16T17:20:57.1096565Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:57.1097236Z  - Length:       2231
2024-05-16T17:20:57.1097550Z Verifier analysis:
2024-05-16T17:20:57.1097732Z 
2024-05-16T17:20:57.1097845Z magic: 0xeb9f
2024-05-16T17:20:57.1098094Z version: 1
2024-05-16T17:20:57.1098345Z flags: 0x0
2024-05-16T17:20:57.1098593Z hdr_len: 24
2024-05-16T17:20:57.1098837Z type_off: 0
2024-05-16T17:20:57.1099089Z type_len: 900
2024-05-16T17:20:57.1099346Z str_off: 900
2024-05-16T17:20:57.1099588Z str_len: 1307
2024-05-16T17:20:57.1099849Z btf_total_size: 2231
2024-05-16T17:20:57.1100165Z [1] PTR (anon) type_id=2
2024-05-16T17:20:57.1100511Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:57.1100893Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:57.1101279Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:57.1101670Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:57.1102102Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:57.1102510Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:57.1103080Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:57.1103502Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:57.1103930Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:57.1104339Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:57.1104757Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:57.1105175Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:57.1105572Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:57.1105959Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:57.1106304Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:57.1106721Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:57.1107119Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:57.1107483Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:57.1107877Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:57.1108364Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:57.1108742Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:57.1109154Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:57.1109559Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:57.1109946Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:57.1110378Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:57.1110882Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:57.1111283Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:57.1111688Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:57.1112080Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:57.1112463Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:57.1112874Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:57.1113349Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:57.1113730Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:57.1114148Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:57.1114574Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:57.1115048Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:57.1115552Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:57.1116195Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:57.1116826Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:57.1117477Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:57.1117952Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:57.1118307Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:57.1118756Z [9] PTR (anon) type_id=29
2024-05-16T17:20:57.1119094Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:57.1119623Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:57.1120278Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:57.1120685Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:57.1121021Z [13] PTR (anon) type_id=30
2024-05-16T17:20:57.1121361Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:57.1121871Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:57.1122458Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1123091Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:57.1123617Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:57.1124060Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1124516Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:57.1124973Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1125439Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:57.1125926Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:57.1126402Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:57.1126945Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:57.1127532Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:57.1128025Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:57.1128546Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:57.1128861Z 
2024-05-16T17:20:59.1908676Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-16T17:20:59.2377387Z 
2024-05-16T17:20:59.2378419Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:59.2379576Z  - Length:       2231
2024-05-16T17:20:59.2380121Z Verifier analysis:
2024-05-16T17:20:59.2380475Z 
2024-05-16T17:20:59.2380660Z magic: 0xeb9f
2024-05-16T17:20:59.2381129Z version: 1
2024-05-16T17:20:59.2381534Z flags: 0x0
2024-05-16T17:20:59.2381964Z hdr_len: 24
2024-05-16T17:20:59.2382427Z type_off: 0
2024-05-16T17:20:59.2382890Z type_len: 900
2024-05-16T17:20:59.2383377Z str_off: 900
2024-05-16T17:20:59.2383855Z str_len: 1307
2024-05-16T17:20:59.2384324Z btf_total_size: 2231
2024-05-16T17:20:59.2384846Z [1] PTR (anon) type_id=2
2024-05-16T17:20:59.2385492Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:59.2386212Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:59.2386866Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:59.2387840Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:59.2388528Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:59.2389326Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:59.2389991Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:59.2390750Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:59.2391516Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:59.2392292Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:59.2393071Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:59.2393892Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:59.2394614Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:59.2395323Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:59.2396005Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:59.2396733Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:59.2397476Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:59.2398196Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:59.2398950Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:59.2399649Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:59.2400404Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:59.2401033Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:59.2401460Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:59.2401928Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:59.2402463Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:59.2402884Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:59.2403297Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:59.2403870Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:59.2404333Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:59.2405061Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:59.2405732Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:59.2406439Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:59.2406992Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:59.2407792Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:59.2408513Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:59.2408917Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:59.2409499Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:59.2410126Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:59.2410878Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:59.2411536Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:59.2412000Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:59.2412452Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:59.2412836Z [9] PTR (anon) type_id=29
2024-05-16T17:20:59.2413239Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:59.2413876Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:59.2414722Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:59.2415291Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:59.2415695Z [13] PTR (anon) type_id=30
2024-05-16T17:20:59.2416283Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:59.2417128Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:59.2418418Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2419436Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:59.2420257Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:59.2421097Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2421920Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:59.2422768Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2423665Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:59.2424564Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2425430Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:59.2426413Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:59.2427448Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:59.2428542Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:59.2429280Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:59.2429902Z 
2024-05-16T17:20:59.2472722Z 
2024-05-16T17:20:59.2473646Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:20:59.2474715Z  - Length:       2231
2024-05-16T17:20:59.2475291Z Verifier analysis:
2024-05-16T17:20:59.2475639Z 
2024-05-16T17:20:59.2475825Z magic: 0xeb9f
2024-05-16T17:20:59.2476306Z version: 1
2024-05-16T17:20:59.2476763Z flags: 0x0
2024-05-16T17:20:59.2477188Z hdr_len: 24
2024-05-16T17:20:59.2477626Z type_off: 0
2024-05-16T17:20:59.2478115Z type_len: 900
2024-05-16T17:20:59.2478580Z str_off: 900
2024-05-16T17:20:59.2479060Z str_len: 1307
2024-05-16T17:20:59.2479561Z btf_total_size: 2231
2024-05-16T17:20:59.2480115Z [1] PTR (anon) type_id=2
2024-05-16T17:20:59.2480763Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:20:59.2481502Z 	len type_id=3 bits_offset=0
2024-05-16T17:20:59.2482153Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:20:59.2482870Z 	mark type_id=3 bits_offset=64
2024-05-16T17:20:59.2483604Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:20:59.2484390Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:20:59.2485121Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:20:59.2485828Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:20:59.2486540Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:20:59.2487313Z 	priority type_id=3 bits_offset=256
2024-05-16T17:20:59.2488102Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:20:59.2488910Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:20:59.2489646Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:20:59.2490382Z 	cb type_id=5 bits_offset=384
2024-05-16T17:20:59.2491112Z 	hash type_id=3 bits_offset=544
2024-05-16T17:20:59.2491831Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:20:59.2492592Z 	data type_id=3 bits_offset=608
2024-05-16T17:20:59.2493288Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:20:59.2494040Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:20:59.2494745Z 	family type_id=3 bits_offset=704
2024-05-16T17:20:59.2495420Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:20:59.2496214Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:20:59.2496889Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:20:59.2497282Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:20:59.2497785Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:20:59.2498267Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:20:59.2498743Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:20:59.2499155Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:20:59.2499712Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:20:59.2500104Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:20:59.2500767Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:20:59.2501465Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:20:59.2502200Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:20:59.2502716Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:20:59.2503530Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:20:59.2504282Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:20:59.2505399Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:59.2506615Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:20:59.2507417Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:20:59.2508075Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:20:59.2508626Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:20:59.2508991Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:20:59.2509492Z [9] PTR (anon) type_id=29
2024-05-16T17:20:59.2509840Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:20:59.2510537Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:20:59.2511399Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:20:59.2511837Z 	sk type_id=13 bits_offset=0
2024-05-16T17:20:59.2512409Z [13] PTR (anon) type_id=30
2024-05-16T17:20:59.2513102Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:20:59.2514047Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:20:59.2515109Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2515962Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:20:59.2516922Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:20:59.2517735Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2518581Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:20:59.2519431Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2520337Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:20:59.2521245Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:20:59.2522117Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:20:59.2523079Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:20:59.2524140Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:20:59.2525020Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:20:59.2525778Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:20:59.2526384Z 
2024-05-16T17:21:01.3307093Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-16T17:21:01.3779877Z 
2024-05-16T17:21:01.3780898Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:21:01.3781517Z  - Length:       2231
2024-05-16T17:21:01.3781817Z Verifier analysis:
2024-05-16T17:21:01.3782019Z 
2024-05-16T17:21:01.3782148Z magic: 0xeb9f
2024-05-16T17:21:01.3782411Z version: 1
2024-05-16T17:21:01.3782661Z flags: 0x0
2024-05-16T17:21:01.3782895Z hdr_len: 24
2024-05-16T17:21:01.3783150Z type_off: 0
2024-05-16T17:21:01.3783408Z type_len: 900
2024-05-16T17:21:01.3783656Z str_off: 900
2024-05-16T17:21:01.3783913Z str_len: 1307
2024-05-16T17:21:01.3784173Z btf_total_size: 2231
2024-05-16T17:21:01.3784487Z [1] PTR (anon) type_id=2
2024-05-16T17:21:01.3784839Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:21:01.3785228Z 	len type_id=3 bits_offset=0
2024-05-16T17:21:01.3785611Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:21:01.3786000Z 	mark type_id=3 bits_offset=64
2024-05-16T17:21:01.3786380Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:21:01.3786806Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:21:01.3787215Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:21:01.3787622Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:21:01.3788027Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:21:01.3788438Z 	priority type_id=3 bits_offset=256
2024-05-16T17:21:01.3788850Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:21:01.3789286Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:21:01.3789681Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:21:01.3790068Z 	cb type_id=5 bits_offset=384
2024-05-16T17:21:01.3790417Z 	hash type_id=3 bits_offset=544
2024-05-16T17:21:01.3790802Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:21:01.3791204Z 	data type_id=3 bits_offset=608
2024-05-16T17:21:01.3791565Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:21:01.3791974Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:21:01.3792366Z 	family type_id=3 bits_offset=704
2024-05-16T17:21:01.3793031Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:21:01.3793452Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:21:01.3793861Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:21:01.3794251Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:21:01.3794666Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:21:01.3795092Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:21:01.3795497Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:21:01.3795899Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:21:01.3796290Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:21:01.3796677Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:21:01.3797078Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:21:01.3797481Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:21:01.3797863Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:21:01.3798398Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:21:01.3798828Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:21:01.3799218Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:21:01.3799720Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:21:01.3800355Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:21:01.3800993Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:21:01.3801648Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:21:01.3802125Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:21:01.3802484Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:21:01.3802869Z [9] PTR (anon) type_id=29
2024-05-16T17:21:01.3803210Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:21:01.3803743Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:21:01.3804338Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:21:01.3804705Z 	sk type_id=13 bits_offset=0
2024-05-16T17:21:01.3805059Z [13] PTR (anon) type_id=30
2024-05-16T17:21:01.3805399Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:21:01.3805913Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:21:01.3806503Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3807041Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:21:01.3807579Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:21:01.3808023Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3808486Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:21:01.3808951Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3809422Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:21:01.3809909Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3810388Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:21:01.3811004Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:21:01.3811577Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:21:01.3812077Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:21:01.3812525Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:21:01.3812837Z 
2024-05-16T17:21:01.3872311Z 
2024-05-16T17:21:01.3872884Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-16T17:21:01.3873542Z  - Length:       2231
2024-05-16T17:21:01.3873887Z Verifier analysis:
2024-05-16T17:21:01.3874074Z 
2024-05-16T17:21:01.3874184Z magic: 0xeb9f
2024-05-16T17:21:01.3874433Z version: 1
2024-05-16T17:21:01.3874678Z flags: 0x0
2024-05-16T17:21:01.3874926Z hdr_len: 24
2024-05-16T17:21:01.3875168Z type_off: 0
2024-05-16T17:21:01.3875419Z type_len: 900
2024-05-16T17:21:01.3875685Z str_off: 900
2024-05-16T17:21:01.3875932Z str_len: 1307
2024-05-16T17:21:01.3876199Z btf_total_size: 2231
2024-05-16T17:21:01.3876511Z [1] PTR (anon) type_id=2
2024-05-16T17:21:01.3876850Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-16T17:21:01.3877248Z 	len type_id=3 bits_offset=0
2024-05-16T17:21:01.3877627Z 	pkt_type type_id=3 bits_offset=32
2024-05-16T17:21:01.3878002Z 	mark type_id=3 bits_offset=64
2024-05-16T17:21:01.3878562Z 	queue_mapping type_id=3 bits_offset=96
2024-05-16T17:21:01.3878997Z 	protocol type_id=3 bits_offset=128
2024-05-16T17:21:01.3879396Z 	vlan_present type_id=3 bits_offset=160
2024-05-16T17:21:01.3879816Z 	vlan_tci type_id=3 bits_offset=192
2024-05-16T17:21:01.3880220Z 	vlan_proto type_id=3 bits_offset=224
2024-05-16T17:21:01.3880619Z 	priority type_id=3 bits_offset=256
2024-05-16T17:21:01.3881039Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-16T17:21:01.3881474Z 	ifindex type_id=3 bits_offset=320
2024-05-16T17:21:01.3881852Z 	tc_index type_id=3 bits_offset=352
2024-05-16T17:21:01.3882239Z 	cb type_id=5 bits_offset=384
2024-05-16T17:21:01.3882602Z 	hash type_id=3 bits_offset=544
2024-05-16T17:21:01.3882976Z 	tc_classid type_id=3 bits_offset=576
2024-05-16T17:21:01.3883381Z 	data type_id=3 bits_offset=608
2024-05-16T17:21:01.3883759Z 	data_end type_id=3 bits_offset=640
2024-05-16T17:21:01.3884226Z 	napi_id type_id=3 bits_offset=672
2024-05-16T17:21:01.3884615Z 	family type_id=3 bits_offset=704
2024-05-16T17:21:01.3885014Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-16T17:21:01.3885407Z 	local_ip4 type_id=3 bits_offset=768
2024-05-16T17:21:01.3885814Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-16T17:21:01.3886222Z 	local_ip6 type_id=7 bits_offset=928
2024-05-16T17:21:01.3886618Z 	remote_port type_id=3 bits_offset=1056
2024-05-16T17:21:01.3887046Z 	local_port type_id=3 bits_offset=1088
2024-05-16T17:21:01.3887464Z 	data_meta type_id=3 bits_offset=1120
2024-05-16T17:21:01.3887856Z 	(anon) type_id=8 bits_offset=1152
2024-05-16T17:21:01.3888249Z 	tstamp type_id=10 bits_offset=1216
2024-05-16T17:21:01.3888650Z 	wire_len type_id=3 bits_offset=1280
2024-05-16T17:21:01.3889042Z 	gso_segs type_id=3 bits_offset=1312
2024-05-16T17:21:01.3889444Z 	(anon) type_id=12 bits_offset=1344
2024-05-16T17:21:01.3889839Z 	gso_size type_id=3 bits_offset=1408
2024-05-16T17:21:01.3890246Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-16T17:21:01.3890748Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-16T17:21:01.3891144Z [3] TYPEDEF __u32 type_id=4
2024-05-16T17:21:01.3891637Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:21:01.3892269Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-16T17:21:01.3892919Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-16T17:21:01.3893558Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-16T17:21:01.3894031Z [8] UNION (anon) size=8 vlen=1
2024-05-16T17:21:01.3894402Z 	flow_keys type_id=9 bits_offset=0
2024-05-16T17:21:01.3894770Z [9] PTR (anon) type_id=29
2024-05-16T17:21:01.3895108Z [10] TYPEDEF __u64 type_id=11
2024-05-16T17:21:01.3895654Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-16T17:21:01.3896238Z [12] UNION (anon) size=8 vlen=1
2024-05-16T17:21:01.3896610Z 	sk type_id=13 bits_offset=0
2024-05-16T17:21:01.3896965Z [13] PTR (anon) type_id=30
2024-05-16T17:21:01.3897293Z [14] TYPEDEF __u8 type_id=15
2024-05-16T17:21:01.3897806Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-16T17:21:01.3898406Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3898935Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-16T17:21:01.3899466Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-16T17:21:01.3899921Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3900375Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-16T17:21:01.3900836Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3901319Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-16T17:21:01.3901808Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-16T17:21:01.3902278Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-16T17:21:01.3902833Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-16T17:21:01.3903420Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-16T17:21:01.3903909Z [27] VAR _license type_id=26 linkage=1
2024-05-16T17:21:01.3904435Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-16T17:21:01.3904748Z 
2024-05-16T17:21:03.4675069Z #149/1   lwt_redirect/lwt_redirect_normal:OK
2024-05-16T17:21:03.4675624Z #149/2   lwt_redirect/lwt_redirect_normal_nomac:OK
2024-05-16T17:21:03.4676130Z #149/3   lwt_redirect/lwt_redirect_dev_down:OK
2024-05-16T17:21:03.4676633Z #149/4   lwt_redirect/lwt_redirect_dev_down_nomac:OK
2024-05-16T17:21:03.4677166Z #149/5   lwt_redirect/lwt_redirect_dev_carrier_down:OK
2024-05-16T17:21:03.4677627Z #149     lwt_redirect:OK
2024-05-16T17:21:03.8700369Z #151/1   map_btf/array_btf:OK
2024-05-16T17:21:03.8701099Z #151/2   map_btf/inner_array_btf:OK
2024-05-16T17:21:03.8701744Z #151     map_btf:OK
2024-05-16T17:21:03.8999468Z #152/1   map_init/pcpu_map_init:OK
2024-05-16T17:21:03.9000232Z #152/2   map_init/pcpu_lru_map_init:OK
2024-05-16T17:21:03.9000919Z #152     map_init:OK
2024-05-16T17:21:04.4501279Z #153/1   map_in_map/acc_map_in_array:OK
2024-05-16T17:21:04.4502193Z #153/2   map_in_map/sleepable_acc_map_in_array:OK
2024-05-16T17:21:04.4503099Z #153/3   map_in_map/acc_map_in_htab:OK
2024-05-16T17:21:04.4503919Z #153/4   map_in_map/sleepable_acc_map_in_htab:OK
2024-05-16T17:21:04.4504716Z #153     map_in_map:OK
2024-05-16T17:21:05.8150652Z #154/1   map_kptr/size_not_bpf_dw:OK
2024-05-16T17:21:05.8151582Z #154/2   map_kptr/non_const_var_off:OK
2024-05-16T17:21:05.8152486Z #154/3   map_kptr/non_const_var_off_kptr_xchg:OK
2024-05-16T17:21:05.8153328Z #154/4   map_kptr/misaligned_access_write:OK
2024-05-16T17:21:05.8154179Z #154/5   map_kptr/misaligned_access_read:OK
2024-05-16T17:21:05.8155020Z #154/6   map_kptr/reject_var_off_store:OK
2024-05-16T17:21:05.8155847Z #154/7   map_kptr/reject_bad_type_match:OK
2024-05-16T17:21:05.8156729Z #154/8   map_kptr/marked_as_untrusted_or_null:OK
2024-05-16T17:21:05.8157606Z #154/9   map_kptr/correct_btf_id_check_size:OK
2024-05-16T17:21:05.8158348Z #154/10  map_kptr/inherit_untrusted_on_walk:OK
2024-05-16T17:21:05.8159078Z #154/11  map_kptr/reject_kptr_xchg_on_unref:OK
2024-05-16T17:21:05.8159798Z #154/12  map_kptr/mark_ref_as_untrusted_or_null:OK
2024-05-16T17:21:05.8160765Z #154/13  map_kptr/reject_untrusted_store_to_ref:OK
2024-05-16T17:21:05.8161692Z #154/14  map_kptr/reject_untrusted_xchg:OK
2024-05-16T17:21:05.8162541Z #154/15  map_kptr/reject_bad_type_xchg:OK
2024-05-16T17:21:05.8163396Z #154/16  map_kptr/reject_member_of_ref_xchg:OK
2024-05-16T17:21:05.8164390Z #154/17  map_kptr/reject_indirect_global_func_access:OK
2024-05-16T17:21:05.8165341Z #154/18  map_kptr/kptr_xchg_ref_state:OK
2024-05-16T17:21:05.8166106Z #154/19  map_kptr/kptr_xchg_possibly_null:OK
2024-05-16T17:21:05.8166939Z #154/20  map_kptr/reject_indirect_helper_access:OK
2024-05-16T17:21:05.8168066Z #154/21  map_kptr/success-map:OK
2024-05-16T17:21:05.8168719Z #154     map_kptr:OK
2024-05-16T17:21:05.8339122Z #155     map_lock:OK
2024-05-16T17:21:05.8422872Z #156     map_lookup_percpu_elem:OK
2024-05-16T17:21:06.0080081Z #157/1   map_ops/map_ops_update_delete:OK
2024-05-16T17:21:06.0080895Z #157/2   map_ops/map_ops_push_peek_pop:OK
2024-05-16T17:21:06.0081548Z #157/3   map_ops/map_ops_for_each:OK
2024-05-16T17:21:06.0082086Z #157     map_ops:OK
2024-05-16T17:21:06.0442112Z #158     map_ptr:OK
2024-05-16T17:21:06.0442754Z #159/1   metadata/unused:OK
2024-05-16T17:21:06.0443388Z #159/2   metadata/used:OK
2024-05-16T17:21:06.0443990Z #159     metadata:OK
2024-05-16T17:21:09.8879658Z #160/1   migrate_reuseport/IPv4 TCP_ESTABLISHED  inet_csk_listen_stop:OK
2024-05-16T17:21:09.8881056Z #160/2   migrate_reuseport/IPv4 TCP_SYN_RECV     inet_csk_listen_stop:OK
2024-05-16T17:21:09.8882467Z #160/4   migrate_reuseport/IPv4 TCP_NEW_SYN_RECV inet_csk_complete_hashdance:OK
