2024-05-21T19:09:59.0709181Z Current runner version: '2.316.1'
2024-05-21T19:09:59.0714458Z Runner name: 'bm-i-014f222431941168d-worker-07'
2024-05-21T19:09:59.0715143Z Runner group name: 'Default'
2024-05-21T19:09:59.0715877Z Machine name: '5cdb67335c65'
2024-05-21T19:09:59.0718005Z ##[group]GITHUB_TOKEN Permissions
2024-05-21T19:09:59.0719664Z Contents: read
2024-05-21T19:09:59.0720154Z Metadata: read
2024-05-21T19:09:59.0720520Z ##[endgroup]
2024-05-21T19:09:59.0722474Z Secret source: Actions
2024-05-21T19:09:59.0723122Z Prepare workflow directory
2024-05-21T19:09:59.1700742Z Prepare all required actions
2024-05-21T19:09:59.1867304Z Getting action download info
2024-05-21T19:09:59.3320866Z Download action repository 'actions/checkout@v4' (SHA:a5ac7e51b41094c92402da3b24376905380afc29)
2024-05-21T19:09:59.6050657Z Download action repository 'actions/download-artifact@v4' (SHA:65a9edc5881444af0b9093a5e628f2fe47ea3b2e)
2024-05-21T19:09:59.8887210Z Download action repository 'libbpf/ci@main' (SHA:5618ba5cc00e40916ecddccbd5f885b29b83b68e)
2024-05-21T19:10:00.1842290Z Uses: kernel-patches/bpf/.github/workflows/kernel-test.yml@refs/pull/7045/merge (667c925c3dc60eca9aef2debd09f6a1c59791d12)
2024-05-21T19:10:00.1845078Z ##[group] Inputs
2024-05-21T19:10:00.1845501Z   arch: x86_64
2024-05-21T19:10:00.1845860Z   toolchain_full: gcc
2024-05-21T19:10:00.1846277Z   runs_on: [
  "self-hosted",
  "x86_64"
]
2024-05-21T19:10:00.1846780Z   kernel: LATEST

2024-05-21T19:11:45.0841166Z #137/99  linked_list/direct_read_node:OK
2024-05-21T19:11:45.0841577Z #137/100 linked_list/direct_write_node:OK
2024-05-21T19:11:45.0842051Z #137/101 linked_list/use_after_unlock_push_front:OK
2024-05-21T19:11:45.0842578Z #137/102 linked_list/use_after_unlock_push_back:OK
2024-05-21T19:11:45.0843047Z #137/103 linked_list/double_push_front:OK
2024-05-21T19:11:45.0843477Z #137/104 linked_list/double_push_back:OK
2024-05-21T19:11:45.0843958Z #137/105 linked_list/no_node_value_type:OK
2024-05-21T19:11:45.0844402Z #137/106 linked_list/incorrect_value_type:OK
2024-05-21T19:11:45.0844883Z #137/107 linked_list/incorrect_node_var_off:OK
2024-05-21T19:11:45.0845351Z #137/108 linked_list/incorrect_node_off1:OK
2024-05-21T19:11:45.0845791Z #137/109 linked_list/incorrect_node_off2:OK
2024-05-21T19:11:45.0846217Z #137/110 linked_list/no_head_type:OK
2024-05-21T19:11:45.0846656Z #137/111 linked_list/incorrect_head_var_off1:OK
2024-05-21T19:11:45.0847129Z #137/112 linked_list/incorrect_head_var_off2:OK
2024-05-21T19:11:45.0847601Z #137/113 linked_list/incorrect_head_off1:OK
2024-05-21T19:11:45.0848050Z #137/114 linked_list/incorrect_head_off2:OK
2024-05-21T19:11:45.0848473Z #137/115 linked_list/pop_front_off:OK
2024-05-21T19:11:45.0848880Z #137/116 linked_list/pop_back_off:OK
2024-05-21T19:11:45.0849300Z #137/117 linked_list/btf: too many locks:OK
2024-05-21T19:11:45.0849730Z #137/118 linked_list/btf: missing lock:OK
2024-05-21T19:11:45.0850160Z #137/119 linked_list/btf: bad offset:OK
2024-05-21T19:11:45.0863816Z #137/120 linked_list/btf: missing contains::OK
2024-05-21T19:11:45.0864318Z #137/121 linked_list/btf: missing struct:OK
2024-05-21T19:11:45.0864774Z #137/122 linked_list/btf: missing node:OK
2024-05-21T19:11:45.0865249Z #137/123 linked_list/btf: node incorrect type:OK
2024-05-21T19:11:45.0865820Z #137/124 linked_list/btf: multiple bpf_list_node with name b:OK
2024-05-21T19:11:45.0866425Z #137/125 linked_list/btf: owning | owned AA cycle:OK
2024-05-21T19:11:45.0866969Z #137/126 linked_list/btf: owning | owned ABA cycle:OK
2024-05-21T19:11:45.0867685Z #137/127 linked_list/btf: owning -> owned:OK
2024-05-21T19:11:45.0868305Z #137/128 linked_list/btf: owning -> owning | owned -> owned:OK
2024-05-21T19:11:45.0869060Z #137/129 linked_list/btf: owning | owned -> owning | owned -> owned:OK
2024-05-21T19:11:45.0869928Z #137/130 linked_list/btf: owning -> owning | owned -> owning | owned -> owned:OK
2024-05-21T19:11:45.0870866Z #137/131 linked_list/btf: list_node and rb_node in same struct:OK
2024-05-21T19:11:45.0871634Z #137/132 linked_list/btf: list_node and rb_node in same struct, no bpf_refcount:OK
2024-05-21T19:11:45.0872254Z #137     linked_list:OK
2024-05-21T19:11:45.1011712Z #138     linked_maps:OK
2024-05-21T19:11:45.2022840Z #139     linked_vars:OK
2024-05-21T19:11:45.2331936Z #140/1   link_pinning/pin_raw_tp:OK
2024-05-21T19:11:45.2332442Z #140/2   link_pinning/pin_tp_btf:OK
2024-05-21T19:11:45.2332846Z #140     link_pinning:OK
2024-05-21T19:11:45.2431594Z #141     load_bytes_relative:OK
2024-05-21T19:11:45.3694999Z #142/1   local_kptr_stash/local_kptr_stash_simple:OK
2024-05-21T19:11:45.3695599Z #142/2   local_kptr_stash/local_kptr_stash_plain:OK
2024-05-21T19:11:45.3696188Z #142/3   local_kptr_stash/local_kptr_stash_local_with_root:OK
2024-05-21T19:11:45.3697135Z #142/4   local_kptr_stash/local_kptr_stash_unstash:OK
2024-05-21T19:11:45.3697710Z #142/5   local_kptr_stash/refcount_acquire_without_unstash:OK
2024-05-21T19:11:45.3698286Z #142/6   local_kptr_stash/local_kptr_stash_fail:OK
2024-05-21T19:11:45.3698761Z #142/7   local_kptr_stash/stash_rb_nodes:OK
2024-05-21T19:11:45.3699248Z #142/8   local_kptr_stash/drop_rb_node_off:OK
2024-05-21T19:11:45.3699812Z #142     local_kptr_stash:OK
2024-05-21T19:11:45.3701602Z #143/1   log_buf/obj_load_log_buf:OK
2024-05-21T19:11:45.3702005Z #143/2   log_buf/bpf_prog_load_log_buf:OK
2024-05-21T19:11:45.3702442Z #143/3   log_buf/bpf_btf_load_log_buf:OK
2024-05-21T19:11:45.3702833Z #143     log_buf:OK
2024-05-21T19:11:45.5245911Z #144/1   log_fixup/bad_core_relo_trunc_none:OK
2024-05-21T19:11:45.5246637Z #144/2   log_fixup/bad_core_relo_trunc_partial:OK
2024-05-21T19:11:45.5247156Z #144/3   log_fixup/bad_core_relo_trunc_full:OK
2024-05-21T19:11:45.5247625Z #144/4   log_fixup/bad_core_relo_subprog:OK
2024-05-21T19:11:45.5248064Z #144/5   log_fixup/missing_map:OK
2024-05-21T19:11:45.5248446Z #144/6   log_fixup/missing_kfunc:OK
2024-05-21T19:11:45.5248817Z #144     log_fixup:OK
2024-05-21T19:11:45.5751495Z #145/1   lookup_and_delete/lookup_and_delete:OK
2024-05-21T19:11:45.5752138Z #145/2   lookup_and_delete/lookup_and_delete_percpu:OK
2024-05-21T19:11:45.5752694Z #145/3   lookup_and_delete/lookup_and_delete_lru:OK
2024-05-21T19:11:45.5753259Z #145/4   lookup_and_delete/lookup_and_delete_lru_percpu:OK
2024-05-21T19:11:45.5753777Z #145     lookup_and_delete:OK
2024-05-21T19:11:45.7091758Z #146     lookup_key:OK
2024-05-21T19:11:45.9471739Z #147     lru_bug:OK
2024-05-21T19:11:46.5679311Z #148/1   lsm_cgroup/functional:OK
2024-05-21T19:11:46.5679962Z #148/2   lsm_cgroup/nonvoid:OK
2024-05-21T19:11:46.5680354Z #148     lsm_cgroup:OK
2024-05-21T19:11:46.5937261Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:11:46.6431442Z 
2024-05-21T19:11:46.6432352Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:46.6433027Z  - Length:       2231
2024-05-21T19:11:46.6433356Z Verifier analysis:
2024-05-21T19:11:46.6433551Z 
2024-05-21T19:11:46.6433694Z magic: 0xeb9f
2024-05-21T19:11:46.6433984Z version: 1
2024-05-21T19:11:46.6434228Z flags: 0x0
2024-05-21T19:11:46.6434481Z hdr_len: 24
2024-05-21T19:11:46.6434723Z type_off: 0
2024-05-21T19:11:46.6434977Z type_len: 900
2024-05-21T19:11:46.6435240Z str_off: 900
2024-05-21T19:11:46.6435486Z str_len: 1307
2024-05-21T19:11:46.6435754Z btf_total_size: 2231
2024-05-21T19:11:46.6436072Z [1] PTR (anon) type_id=2
2024-05-21T19:11:46.6436411Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:46.6436811Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:46.6437179Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:46.6437559Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:46.6437938Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:46.6438361Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:46.6438758Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:46.6439182Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:46.6439587Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:46.6439987Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:46.6440713Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:46.6441175Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:46.6441556Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:46.6441949Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:46.6442311Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:46.6442689Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:46.6443098Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:46.6443481Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:46.6443960Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:46.6444357Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:46.6444752Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:46.6445150Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:46.6445561Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:46.6446093Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:46.6446495Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:46.6446934Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:46.6447361Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:46.6447757Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:46.6448174Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:46.6448581Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:46.6448990Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:46.6449381Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:46.6449784Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:46.6450204Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:46.6450626Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:46.6451029Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:46.6451541Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:46.6452163Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:46.6452822Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:46.6453484Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:46.6453946Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:46.6454322Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:46.6454708Z [9] PTR (anon) type_id=29
2024-05-21T19:11:46.6455040Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:46.6455584Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:46.6456185Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:46.6456545Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:46.6456900Z [13] PTR (anon) type_id=30
2024-05-21T19:11:46.6457249Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:46.6457750Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:46.6458353Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6458898Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:46.6459429Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:46.6459884Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6460362Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:46.6460809Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6461294Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:46.6461786Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6462249Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:46.6462803Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:46.6463392Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:46.6463888Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:46.6464316Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:46.6464640Z 
2024-05-21T19:11:46.6524792Z 
2024-05-21T19:11:46.6525376Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:46.6525995Z  - Length:       2231
2024-05-21T19:11:46.6526393Z Verifier analysis:
2024-05-21T19:11:46.6526579Z 
2024-05-21T19:11:46.6526678Z magic: 0xeb9f
2024-05-21T19:11:46.6527121Z version: 1
2024-05-21T19:11:46.6527387Z flags: 0x0
2024-05-21T19:11:46.6527626Z hdr_len: 24
2024-05-21T19:11:46.6527881Z type_off: 0
2024-05-21T19:11:46.6528141Z type_len: 900
2024-05-21T19:11:46.6528391Z str_off: 900
2024-05-21T19:11:46.6528651Z str_len: 1307
2024-05-21T19:11:46.6528908Z btf_total_size: 2231
2024-05-21T19:11:46.6529224Z [1] PTR (anon) type_id=2
2024-05-21T19:11:46.6529575Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:46.6529961Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:46.6530325Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:46.6530715Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:46.6531086Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:46.6531509Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:46.6531926Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:46.6532423Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:46.6532832Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:46.6533241Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:46.6533653Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:46.6534095Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:46.6534490Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:46.6534868Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:46.6535229Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:46.6535610Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:46.6535999Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:46.6536379Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:46.6536777Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:46.6537153Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:46.6537545Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:46.6537954Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:46.6538349Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:46.6538757Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:46.6539168Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:46.6539588Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:46.6540003Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:46.6540409Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:46.6540787Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:46.6541188Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:46.6541589Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:46.6541980Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:46.6542375Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:46.6542791Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:46.6543222Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:46.6543610Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:46.6544117Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:46.6544757Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:46.6545398Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:46.6546057Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:46.6546538Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:46.6546900Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:46.6547283Z [9] PTR (anon) type_id=29
2024-05-21T19:11:46.6547626Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:46.6548157Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:46.6548754Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:46.6549128Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:46.6549468Z [13] PTR (anon) type_id=30
2024-05-21T19:11:46.6549811Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:46.6550323Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:46.6550914Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6551474Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:46.6552020Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:46.6552464Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6553002Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:46.6553474Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6553946Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:46.6554438Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:46.6554916Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:46.6555463Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:46.6556057Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:46.6556559Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:46.6556991Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:46.6557315Z 
2024-05-21T19:11:48.7341752Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:11:48.7814878Z 
2024-05-21T19:11:48.7816161Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:48.7816788Z  - Length:       2231
2024-05-21T19:11:48.7817096Z Verifier analysis:
2024-05-21T19:11:48.7817298Z 
2024-05-21T19:11:48.7817412Z magic: 0xeb9f
2024-05-21T19:11:48.7817712Z version: 1
2024-05-21T19:11:48.7817952Z flags: 0x0
2024-05-21T19:11:48.7818205Z hdr_len: 24
2024-05-21T19:11:48.7818464Z type_off: 0
2024-05-21T19:11:48.7818709Z type_len: 900
2024-05-21T19:11:48.7818973Z str_off: 900
2024-05-21T19:11:48.7819236Z str_len: 1307
2024-05-21T19:11:48.7819494Z btf_total_size: 2231
2024-05-21T19:11:48.7819812Z [1] PTR (anon) type_id=2
2024-05-21T19:11:48.7820163Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:48.7820549Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:48.7820917Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:48.7821307Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:48.7821678Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:48.7822104Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:48.7822527Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:48.7822932Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:48.7823340Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:48.7823764Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:48.7824175Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:48.7824616Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:48.7825011Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:48.7825386Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:48.7825747Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:48.7826136Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:48.7826524Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:48.7826907Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:48.7827308Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:48.7827684Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:48.7828075Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:48.7828482Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:48.7828885Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:48.7829294Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:48.7829710Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:48.7830135Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:48.7830558Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:48.7830960Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:48.7831343Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:48.7831751Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:48.7832158Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:48.7832551Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:48.7832950Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:48.7833368Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:48.7833788Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:48.7834186Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:48.7834689Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:48.7835317Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:48.7835970Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:48.7836830Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:48.7837320Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:48.7837686Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:48.7838074Z [9] PTR (anon) type_id=29
2024-05-21T19:11:48.7838419Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:48.7838953Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:48.7839555Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:48.7839929Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:48.7840268Z [13] PTR (anon) type_id=30
2024-05-21T19:11:48.7840609Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:48.7841124Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:48.7841716Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7842321Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:48.7842861Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:48.7843313Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7843954Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:48.7844424Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7844900Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:48.7845396Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7845883Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:48.7846426Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:48.7847016Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:48.7847515Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:48.7847947Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:48.7848275Z 
2024-05-21T19:11:48.7903845Z 
2024-05-21T19:11:48.7904514Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:48.7905167Z  - Length:       2231
2024-05-21T19:11:48.7905475Z Verifier analysis:
2024-05-21T19:11:48.7905678Z 
2024-05-21T19:11:48.7905786Z magic: 0xeb9f
2024-05-21T19:11:48.7906092Z version: 1
2024-05-21T19:11:48.7906349Z flags: 0x0
2024-05-21T19:11:48.7906586Z hdr_len: 24
2024-05-21T19:11:48.7906842Z type_off: 0
2024-05-21T19:11:48.7907102Z type_len: 900
2024-05-21T19:11:48.7907353Z str_off: 900
2024-05-21T19:11:48.7907618Z str_len: 1307
2024-05-21T19:11:48.7907891Z btf_total_size: 2231
2024-05-21T19:11:48.7908195Z [1] PTR (anon) type_id=2
2024-05-21T19:11:48.7908545Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:48.7908932Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:48.7909300Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:48.7909689Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:48.7910059Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:48.7910489Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:48.7910914Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:48.7911332Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:48.7911726Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:48.7912143Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:48.7912570Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:48.7912993Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:48.7913384Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:48.7913778Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:48.7914130Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:48.7914517Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:48.7914923Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:48.7915291Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:48.7915693Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:48.7916088Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:48.7916468Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:48.7916878Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:48.7917295Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:48.7917689Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:48.7918106Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:48.7918716Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:48.7919132Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:48.7919546Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:48.7919943Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:48.7920335Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:48.7920748Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:48.7921154Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:48.7921537Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:48.7921953Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:48.7922385Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:48.7922769Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:48.7923279Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:48.7924150Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:48.7924791Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:48.7925455Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:48.7925937Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:48.7926298Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:48.7926682Z [9] PTR (anon) type_id=29
2024-05-21T19:11:48.7927023Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:48.7927555Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:48.7928153Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:48.7928525Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:48.7928863Z [13] PTR (anon) type_id=30
2024-05-21T19:11:48.7929206Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:48.7929717Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:48.7930304Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7930851Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:48.7931382Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:48.7931831Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7932428Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:48.7932894Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7933368Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:48.7933857Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:48.7934337Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:48.7934878Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:48.7935470Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:48.7935969Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:48.7936402Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:48.7936732Z 
2024-05-21T19:11:50.8644373Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:11:50.9210002Z 
2024-05-21T19:11:50.9210872Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:50.9211785Z  - Length:       2231
2024-05-21T19:11:50.9212323Z Verifier analysis:
2024-05-21T19:11:50.9212710Z 
2024-05-21T19:11:50.9212892Z magic: 0xeb9f
2024-05-21T19:11:50.9213375Z version: 1
2024-05-21T19:11:50.9213808Z flags: 0x0
2024-05-21T19:11:50.9214257Z hdr_len: 24
2024-05-21T19:11:50.9214702Z type_off: 0
2024-05-21T19:11:50.9214992Z type_len: 900
2024-05-21T19:11:50.9215259Z str_off: 900
2024-05-21T19:11:50.9215508Z str_len: 1307
2024-05-21T19:11:50.9215791Z btf_total_size: 2231
2024-05-21T19:11:50.9216109Z [1] PTR (anon) type_id=2
2024-05-21T19:11:50.9216446Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:50.9216850Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:50.9217221Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:50.9217600Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:50.9217980Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:50.9218414Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:50.9218807Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:50.9219413Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:50.9220514Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:50.9221266Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:50.9222046Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:50.9222844Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:50.9223527Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:50.9224265Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:50.9224933Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:50.9225614Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:50.9226358Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:50.9227052Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:50.9227763Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:50.9228475Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:50.9229197Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:50.9230071Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:50.9230827Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:50.9231585Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:50.9232344Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:50.9233139Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:50.9233829Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:50.9234236Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:50.9234622Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:50.9235032Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:50.9235440Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:50.9235831Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:50.9236232Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:50.9236650Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:50.9237068Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:50.9237469Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:50.9237976Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:50.9238608Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:50.9239261Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:50.9239912Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:50.9240372Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:50.9240744Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:50.9241124Z [9] PTR (anon) type_id=29
2024-05-21T19:11:50.9241453Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:50.9241996Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:50.9242588Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:50.9242942Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:50.9243288Z [13] PTR (anon) type_id=30
2024-05-21T19:11:50.9243628Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:50.9244225Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:50.9244834Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9245377Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:50.9245896Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:50.9246359Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9246819Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:50.9247270Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9247750Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:50.9248237Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9248712Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:50.9249250Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:50.9249839Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:50.9250334Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:50.9250763Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:50.9251088Z 
2024-05-21T19:11:50.9315882Z 
2024-05-21T19:11:50.9316828Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:50.9317907Z  - Length:       2231
2024-05-21T19:11:50.9318501Z Verifier analysis:
2024-05-21T19:11:50.9319053Z 
2024-05-21T19:11:50.9319231Z magic: 0xeb9f
2024-05-21T19:11:50.9319704Z version: 1
2024-05-21T19:11:50.9320151Z flags: 0x0
2024-05-21T19:11:50.9320579Z hdr_len: 24
2024-05-21T19:11:50.9321021Z type_off: 0
2024-05-21T19:11:50.9321481Z type_len: 900
2024-05-21T19:11:50.9321887Z str_off: 900
2024-05-21T19:11:50.9322152Z str_len: 1307
2024-05-21T19:11:50.9322423Z btf_total_size: 2231
2024-05-21T19:11:50.9322725Z [1] PTR (anon) type_id=2
2024-05-21T19:11:50.9323076Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:50.9323475Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:50.9323891Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:50.9324286Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:50.9324884Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:50.9325647Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:50.9326539Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:50.9327300Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:50.9328046Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:50.9328799Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:50.9329573Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:50.9330357Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:50.9331078Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:50.9331797Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:50.9332436Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:50.9333147Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:50.9333873Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:50.9334562Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:50.9335282Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:50.9335987Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:50.9336697Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:50.9337453Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:50.9338210Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:50.9338633Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:50.9339055Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:50.9339489Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:50.9339896Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:50.9340306Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:50.9340699Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:50.9341092Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:50.9341494Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:50.9341904Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:50.9342437Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:50.9343195Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:50.9343991Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:50.9344702Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:50.9345613Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:50.9346772Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:50.9347950Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:50.9349162Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:50.9350035Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:50.9350697Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:50.9351393Z [9] PTR (anon) type_id=29
2024-05-21T19:11:50.9351993Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:50.9352984Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:50.9354089Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:50.9354765Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:50.9355384Z [13] PTR (anon) type_id=30
2024-05-21T19:11:50.9355985Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:50.9356938Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:50.9357829Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9358385Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:50.9358914Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:50.9359636Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9360489Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:50.9361332Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9362206Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:50.9363099Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:50.9363970Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:50.9365002Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:50.9366062Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:50.9366993Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:50.9367798Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:50.9368373Z 
2024-05-21T19:11:53.0160809Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:11:53.0662935Z 
2024-05-21T19:11:53.0664382Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:53.0665485Z  - Length:       2231
2024-05-21T19:11:53.0665901Z Verifier analysis:
2024-05-21T19:11:53.0666092Z 
2024-05-21T19:11:53.0666191Z magic: 0xeb9f
2024-05-21T19:11:53.0666463Z version: 1
2024-05-21T19:11:53.0666719Z flags: 0x0
2024-05-21T19:11:53.0666957Z hdr_len: 24
2024-05-21T19:11:53.0667216Z type_off: 0
2024-05-21T19:11:53.0667474Z type_len: 900
2024-05-21T19:11:53.0667727Z str_off: 900
2024-05-21T19:11:53.0667991Z str_len: 1307
2024-05-21T19:11:53.0668270Z btf_total_size: 2231
2024-05-21T19:11:53.0668576Z [1] PTR (anon) type_id=2
2024-05-21T19:11:53.0668934Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:53.0669339Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:53.0669696Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:53.0670088Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:53.0670478Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:53.0670904Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:53.0671320Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:53.0671749Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:53.0672146Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:53.0672566Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:53.0672995Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:53.0673421Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:53.0673819Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:53.0674214Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:53.0674565Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:53.0674952Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:53.0675358Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:53.0675729Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:53.0676130Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:53.0676523Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:53.0676914Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:53.0677329Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:53.0677742Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:53.0678144Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:53.0678563Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:53.0678993Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:53.0679399Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:53.0679811Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:53.0680210Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:53.0680601Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:53.0681008Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:53.0681415Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:53.0681806Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:53.0682234Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:53.0682664Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:53.0683053Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:53.0683570Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:53.0684303Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:53.0685252Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:53.0685920Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:53.0686398Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:53.0686759Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:53.0687143Z [9] PTR (anon) type_id=29
2024-05-21T19:11:53.0687485Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:53.0688022Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:53.0688622Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:53.0688994Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:53.0689337Z [13] PTR (anon) type_id=30
2024-05-21T19:11:53.0689687Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:53.0690201Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:53.0690894Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0691442Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:53.0691981Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:53.0692427Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0692895Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:53.0693363Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0693837Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:53.0694328Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0694809Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:53.0695355Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:53.0695951Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:53.0696455Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:53.0696902Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:53.0697232Z 
2024-05-21T19:11:53.0759012Z 
2024-05-21T19:11:53.0759748Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:53.0760353Z  - Length:       2231
2024-05-21T19:11:53.0760667Z Verifier analysis:
2024-05-21T19:11:53.0760869Z 
2024-05-21T19:11:53.0761083Z magic: 0xeb9f
2024-05-21T19:11:53.0761351Z version: 1
2024-05-21T19:11:53.0761592Z flags: 0x0
2024-05-21T19:11:53.0761845Z hdr_len: 24
2024-05-21T19:11:53.0762104Z type_off: 0
2024-05-21T19:11:53.0762352Z type_len: 900
2024-05-21T19:11:53.0762620Z str_off: 900
2024-05-21T19:11:53.0762927Z str_len: 1307
2024-05-21T19:11:53.0763186Z btf_total_size: 2231
2024-05-21T19:11:53.0763507Z [1] PTR (anon) type_id=2
2024-05-21T19:11:53.0763963Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:53.0764386Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:53.0764755Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:53.0765129Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:53.0765515Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:53.0765980Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:53.0766390Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:53.0766800Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:53.0767205Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:53.0767613Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:53.0768018Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:53.0768495Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:53.0768887Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:53.0769264Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:53.0769623Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:53.0770015Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:53.0770430Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:53.0770810Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:53.0771204Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:53.0771661Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:53.0772059Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:53.0772472Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:53.0772868Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:53.0773554Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:53.0773980Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:53.0774392Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:53.0774812Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:53.0775281Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:53.0775665Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:53.0776070Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:53.0776478Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:53.0776867Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:53.0777355Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:53.0777769Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:53.0778185Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:53.0778749Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:53.0779414Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:53.0780040Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:53.0780693Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:53.0781348Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:53.0781811Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:53.0782260Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:53.0782643Z [9] PTR (anon) type_id=29
2024-05-21T19:11:53.0782970Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:53.0783519Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:53.0784189Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:53.0784547Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:53.0784900Z [13] PTR (anon) type_id=30
2024-05-21T19:11:53.0785242Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:53.0785835Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:53.0786442Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0786985Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:53.0787525Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:53.0788059Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0788522Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:53.0788983Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0789454Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:53.0789941Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:53.0790422Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:53.0790964Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:53.0791551Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:53.0792048Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:53.0792472Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:53.0792801Z 
2024-05-21T19:11:55.1559325Z net.ipv6.conf.all.disable_ipv6 = 1
2024-05-21T19:11:55.2140003Z 
2024-05-21T19:11:55.2141066Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:55.2141711Z  - Length:       2231
2024-05-21T19:11:55.2142022Z Verifier analysis:
2024-05-21T19:11:55.2142227Z 
2024-05-21T19:11:55.2142326Z magic: 0xeb9f
2024-05-21T19:11:55.2142631Z version: 1
2024-05-21T19:11:55.2142888Z flags: 0x0
2024-05-21T19:11:55.2143124Z hdr_len: 24
2024-05-21T19:11:55.2143379Z type_off: 0
2024-05-21T19:11:55.2143635Z type_len: 900
2024-05-21T19:11:55.2143887Z str_off: 900
2024-05-21T19:11:55.2144152Z str_len: 1307
2024-05-21T19:11:55.2144425Z btf_total_size: 2231
2024-05-21T19:11:55.2144732Z [1] PTR (anon) type_id=2
2024-05-21T19:11:55.2145083Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:55.2145486Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:55.2145841Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:55.2146233Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:55.2146626Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:55.2147036Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:55.2147449Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:55.2148138Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:55.2148541Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:55.2148958Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:55.2149386Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:55.2149814Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:55.2150214Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:55.2150609Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:55.2150962Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:55.2151354Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:55.2151758Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:55.2152128Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:55.2152532Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:55.2152928Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:55.2153417Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:55.2153840Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:55.2154263Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:55.2154658Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:55.2155074Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:55.2155502Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:55.2155909Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:55.2156313Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:55.2156709Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:55.2157101Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:55.2157506Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:55.2157911Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:55.2158293Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:55.2158709Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:55.2159138Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:55.2159528Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:55.2160041Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:55.2160675Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:55.2161311Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:55.2161966Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:55.2162446Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:55.2162813Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:55.2163201Z [9] PTR (anon) type_id=29
2024-05-21T19:11:55.2163544Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:55.2164261Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:55.2164876Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:55.2165249Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:55.2165591Z [13] PTR (anon) type_id=30
2024-05-21T19:11:55.2165940Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:55.2166466Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:55.2167075Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2167619Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:55.2168166Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:55.2168629Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2169080Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:55.2169547Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2170036Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:55.2170517Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2171004Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:55.2171569Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:55.2172263Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:55.2172991Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:55.2173448Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:55.2173763Z 
2024-05-21T19:11:55.2254064Z 
2024-05-21T19:11:55.2255108Z BTF debug data section '.BTF' rejected: Invalid argument (22)!
2024-05-21T19:11:55.2256336Z  - Length:       2231
2024-05-21T19:11:55.2256814Z Verifier analysis:
2024-05-21T19:11:55.2257114Z 
2024-05-21T19:11:55.2257217Z magic: 0xeb9f
2024-05-21T19:11:55.2257486Z version: 1
2024-05-21T19:11:55.2257731Z flags: 0x0
2024-05-21T19:11:55.2257986Z hdr_len: 24
2024-05-21T19:11:55.2258249Z type_off: 0
2024-05-21T19:11:55.2258497Z type_len: 900
2024-05-21T19:11:55.2258768Z str_off: 900
2024-05-21T19:11:55.2259034Z str_len: 1307
2024-05-21T19:11:55.2259295Z btf_total_size: 2231
2024-05-21T19:11:55.2259618Z [1] PTR (anon) type_id=2
2024-05-21T19:11:55.2259971Z [2] STRUCT __sk_buff size=192 vlen=34
2024-05-21T19:11:55.2260375Z 	len type_id=3 bits_offset=0
2024-05-21T19:11:55.2260786Z 	pkt_type type_id=3 bits_offset=32
2024-05-21T19:11:55.2261180Z 	mark type_id=3 bits_offset=64
2024-05-21T19:11:55.2261665Z 	queue_mapping type_id=3 bits_offset=96
2024-05-21T19:11:55.2262097Z 	protocol type_id=3 bits_offset=128
2024-05-21T19:11:55.2262521Z 	vlan_present type_id=3 bits_offset=160
2024-05-21T19:11:55.2262940Z 	vlan_tci type_id=3 bits_offset=192
2024-05-21T19:11:55.2263350Z 	vlan_proto type_id=3 bits_offset=224
2024-05-21T19:11:55.2263804Z 	priority type_id=3 bits_offset=256
2024-05-21T19:11:55.2264215Z 	ingress_ifindex type_id=3 bits_offset=288
2024-05-21T19:11:55.2264649Z 	ifindex type_id=3 bits_offset=320
2024-05-21T19:11:55.2265051Z 	tc_index type_id=3 bits_offset=352
2024-05-21T19:11:55.2265431Z 	cb type_id=5 bits_offset=384
2024-05-21T19:11:55.2265826Z 	hash type_id=3 bits_offset=544
2024-05-21T19:11:55.2266212Z 	tc_classid type_id=3 bits_offset=576
2024-05-21T19:11:55.2266602Z 	data type_id=3 bits_offset=608
2024-05-21T19:11:55.2266986Z 	data_end type_id=3 bits_offset=640
2024-05-21T19:11:55.2267386Z 	napi_id type_id=3 bits_offset=672
2024-05-21T19:11:55.2267766Z 	family type_id=3 bits_offset=704
2024-05-21T19:11:55.2268164Z 	remote_ip4 type_id=3 bits_offset=736
2024-05-21T19:11:55.2268608Z 	local_ip4 type_id=3 bits_offset=768
2024-05-21T19:11:55.2269014Z 	remote_ip6 type_id=7 bits_offset=800
2024-05-21T19:11:55.2269422Z 	local_ip6 type_id=7 bits_offset=928
2024-05-21T19:11:55.2269838Z 	remote_port type_id=3 bits_offset=1056
2024-05-21T19:11:55.2270254Z 	local_port type_id=3 bits_offset=1088
2024-05-21T19:11:55.2270675Z 	data_meta type_id=3 bits_offset=1120
2024-05-21T19:11:55.2271085Z 	(anon) type_id=8 bits_offset=1152
2024-05-21T19:11:55.2271469Z 	tstamp type_id=10 bits_offset=1216
2024-05-21T19:11:55.2271873Z 	wire_len type_id=3 bits_offset=1280
2024-05-21T19:11:55.2272352Z 	gso_segs type_id=3 bits_offset=1312
2024-05-21T19:11:55.2272755Z 	(anon) type_id=12 bits_offset=1344
2024-05-21T19:11:55.2273150Z 	gso_size type_id=3 bits_offset=1408
2024-05-21T19:11:55.2273565Z 	tstamp_type type_id=14 bits_offset=1440
2024-05-21T19:11:55.2273988Z 	hwtstamp type_id=10 bits_offset=1472
2024-05-21T19:11:55.2274394Z [3] TYPEDEF __u32 type_id=4
2024-05-21T19:11:55.2274983Z [4] INT unsigned int size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:55.2275609Z [5] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=5
2024-05-21T19:11:55.2276265Z [6] INT __ARRAY_SIZE_TYPE__ size=4 bits_offset=0 nr_bits=32 encoding=(none)
2024-05-21T19:11:55.2276969Z [7] ARRAY (anon) type_id=3 index_type_id=6 nr_elems=4
2024-05-21T19:11:55.2277460Z [8] UNION (anon) size=8 vlen=1
2024-05-21T19:11:55.2277821Z 	flow_keys type_id=9 bits_offset=0
2024-05-21T19:11:55.2278204Z [9] PTR (anon) type_id=29
2024-05-21T19:11:55.2278543Z [10] TYPEDEF __u64 type_id=11
2024-05-21T19:11:55.2279178Z [11] INT unsigned long long size=8 bits_offset=0 nr_bits=64 encoding=(none)
2024-05-21T19:11:55.2279781Z [12] UNION (anon) size=8 vlen=1
2024-05-21T19:11:55.2280155Z 	sk type_id=13 bits_offset=0
2024-05-21T19:11:55.2280561Z [13] PTR (anon) type_id=30
2024-05-21T19:11:55.2280950Z [14] TYPEDEF __u8 type_id=15
2024-05-21T19:11:55.2281461Z [15] INT unsigned char size=1 bits_offset=0 nr_bits=8 encoding=(none)
2024-05-21T19:11:55.2282062Z [16] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2282714Z [17] INT int size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
2024-05-21T19:11:55.2283259Z [18] FUNC test_lwt_redirect_in type_id=16
2024-05-21T19:11:55.2283709Z [19] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2284266Z [20] FUNC test_lwt_redirect_out type_id=19
2024-05-21T19:11:55.2284813Z [21] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2285287Z [22] FUNC test_lwt_redirect_out_nomac type_id=21
2024-05-21T19:11:55.2285779Z [23] FUNC_PROTO (anon) return=17 args=(1 skb)
2024-05-21T19:11:55.2286271Z [24] FUNC test_lwt_redirect_in_nomac type_id=23
2024-05-21T19:11:55.2286876Z [25] INT char size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
2024-05-21T19:11:55.2287472Z [26] ARRAY (anon) type_id=25 index_type_id=6 nr_elems=4
2024-05-21T19:11:55.2287973Z [27] VAR _license type_id=26 linkage=1
2024-05-21T19:11:55.2288514Z [28] DATASEC license size=0 vlen=1 size == 0
2024-05-21T19:11:55.2288857Z 
2024-05-21T19:11:57.3047979Z #149/1   lwt_redirect/lwt_redirect_normal:OK
2024-05-21T19:11:57.3048609Z #149/2   lwt_redirect/lwt_redirect_normal_nomac:OK
2024-05-21T19:11:57.3049123Z #149/3   lwt_redirect/lwt_redirect_dev_down:OK
2024-05-21T19:11:57.3049635Z #149/4   lwt_redirect/lwt_redirect_dev_down_nomac:OK
2024-05-21T19:11:57.3050162Z #149/5   lwt_redirect/lwt_redirect_dev_carrier_down:OK
2024-05-21T19:11:57.3050631Z #149     lwt_redirect:OK
2024-05-21T19:11:57.4910790Z #151/1   map_btf/array_btf:OK
2024-05-21T19:11:57.4911356Z #151/2   map_btf/inner_array_btf:OK
2024-05-21T19:11:57.4911755Z #151     map_btf:OK
2024-05-21T19:11:57.5129537Z #152/1   map_init/pcpu_map_init:OK
2024-05-21T19:11:57.5130114Z #152/2   map_init/pcpu_lru_map_init:OK
2024-05-21T19:11:57.5130503Z #152     map_init:OK
2024-05-21T19:11:57.8219589Z #153/1   map_in_map/acc_map_in_array:OK
2024-05-21T19:11:57.8220478Z #153/2   map_in_map/sleepable_acc_map_in_array:OK
2024-05-21T19:11:57.8221300Z #153/3   map_in_map/acc_map_in_htab:OK
2024-05-21T19:11:57.8222060Z #153/4   map_in_map/sleepable_acc_map_in_htab:OK
2024-05-21T19:11:57.8222823Z #153     map_in_map:OK
2024-05-21T19:11:59.2221007Z #154/1   map_kptr/size_not_bpf_dw:OK
2024-05-21T19:11:59.2221661Z #154/2   map_kptr/non_const_var_off:OK
2024-05-21T19:11:59.2222408Z #154/3   map_kptr/non_const_var_off_kptr_xchg:OK
2024-05-21T19:11:59.2223199Z #154/4   map_kptr/misaligned_access_write:OK
2024-05-21T19:11:59.2223661Z #154/5   map_kptr/misaligned_access_read:OK
2024-05-21T19:11:59.2224117Z #154/6   map_kptr/reject_var_off_store:OK
2024-05-21T19:11:59.2224560Z #154/7   map_kptr/reject_bad_type_match:OK
2024-05-21T19:11:59.2225019Z #154/8   map_kptr/marked_as_untrusted_or_null:OK
2024-05-21T19:11:59.2225506Z #154/9   map_kptr/correct_btf_id_check_size:OK
2024-05-21T19:11:59.2225984Z #154/10  map_kptr/inherit_untrusted_on_walk:OK
2024-05-21T19:11:59.2226444Z #154/11  map_kptr/reject_kptr_xchg_on_unref:OK
2024-05-21T19:11:59.2226949Z #154/12  map_kptr/mark_ref_as_untrusted_or_null:OK
2024-05-21T19:11:59.2227469Z #154/13  map_kptr/reject_untrusted_store_to_ref:OK
2024-05-21T19:11:59.2227948Z #154/14  map_kptr/reject_untrusted_xchg:OK
2024-05-21T19:11:59.2228397Z #154/15  map_kptr/reject_bad_type_xchg:OK
2024-05-21T19:11:59.2228852Z #154/16  map_kptr/reject_member_of_ref_xchg:OK
2024-05-21T19:11:59.2229352Z #154/17  map_kptr/reject_indirect_global_func_access:OK
2024-05-21T19:11:59.2229856Z #154/18  map_kptr/kptr_xchg_ref_state:OK
2024-05-21T19:11:59.2230306Z #154/19  map_kptr/kptr_xchg_possibly_null:OK
2024-05-21T19:11:59.2230796Z #154/20  map_kptr/reject_indirect_helper_access:OK
2024-05-21T19:11:59.2231462Z #154/21  map_kptr/success-map:OK
2024-05-21T19:11:59.2231824Z #154     map_kptr:OK
2024-05-21T19:11:59.2437537Z #155     map_lock:OK
2024-05-21T19:11:59.2527704Z #156     map_lookup_percpu_elem:OK
2024-05-21T19:11:59.4941597Z #157/1   map_ops/map_ops_update_delete:OK
2024-05-21T19:11:59.4942327Z #157/2   map_ops/map_ops_push_peek_pop:OK
2024-05-21T19:11:59.4942779Z #157/3   map_ops/map_ops_for_each:OK
2024-05-21T19:11:59.4943164Z #157     map_ops:OK
2024-05-21T19:11:59.5325949Z #158     map_ptr:OK
2024-05-21T19:11:59.5329873Z #159/1   metadata/unused:OK
2024-05-21T19:11:59.5330272Z #159/2   metadata/used:OK
2024-05-21T19:11:59.5330591Z #159     metadata:OK
2024-05-21T19:12:03.3528902Z #160/1   migrate_reuseport/IPv4 TCP_ESTABLISHED  inet_csk_listen_stop:OK
2024-05-21T19:12:03.3529715Z #160/2   migrate_reuseport/IPv4 TCP_SYN_RECV     inet_csk_listen_stop:OK
2024-05-21T19:12:03.3530508Z #160/4   migrate_reuseport/IPv4 TCP_NEW_SYN_RECV inet_csk_complete_hashdance:OK
